{
	"homepage": "https://www.curseforge.com/minecraft/mc-mods/cyclic",
	"promos": {
		"1.18-latest": "1.6.6"
	},
	"1.17.1": {
    "1.6.0":"Ported Cyclic[1.16.5]-1.5.8 to Minecraft [1.17.1] & forge-37.0.85+.  Altered a few crafting recipes to use new items.  Removed Peat Generator (Use Peat items in Material Generator).  Removed 5 Mason blocks, replaced with Compressed Cobblestone, Flint Block.  Added Peace Candle, Translocation Platform, Stone Mattock, Crushing Macerator, and Lava Sponge.  Added Copper Tools and Amethyst Tools, Copper Lantern, Copper Chain, Copper Bars, Gold Chain, Gold Bars, Gold Lantern (Art by @shynieke).  Added Copper Nuggets and Netherite Nuggets.  Added Netherite Lanterns, chains, and bars.  Added 3 Pressure Plates: Copper Netherite and Obsidian. "
    ,"1.6.1":"Enabled buckets (Do not place in world until https://github.com/MinecraftForge/MinecraftForge/issues/7922). Porting updates from [1.16.5]-1.5.10 Fix Battery energy tooltip not updating when charged in an item slot.  Added charging slot to Battery.  Fix sleeping mat bug when used in nether.  Fix Fluid cables visual disconnection when placing.  Machines that use fluid ingredients now accept fluid tags such as 'forge:experience' in place of fluid ID; updated some existing recipes on Solidifier and Evap Generator to match (old recipe JSONs still all compatible/valid).  Fixed battery energy item stack capability provider.  Refreshed texture of Air charm. Vision helmet compat with curios head slot.  Revert GPS card fixes to v1.5.6.  One recipe added to cyclic:generator_fluid for tag forge:biomass.  Default config value updated for disable_pickup on the Sack of Holding.  Add compat for Beheading enchant with the 7 Tinkers Construct mob heads (config heads are still checked last.  no changes if tinkers not installed).  "
    ,"1.6.2":"Fixed recipe parsing JSON errors on server join.  Fix a bugged interaction with Settings data card and Filter data card #1970 . Torch Charm now tries to avoid placing on non-solid blocks such as top side of a bottom Slab where the torch breaks right away. "
    ,"1.6.3":"Added Hunger II Potion effect with brewing stand recipe. Rebalanced a bunch of recipes and added a few new ones.  Rebalanced Launch enchant to an elytra only remake. Updated worldgen configs for the four flowers.  Fireplace block can trigger campfires"
    ,"1.6.4":"Garden Scythe fix visual desync when harvesting.  Monster ball now cannot capture any entity if a player is its immediate passenger (ie: saddle or using stirrups).  "  
  	,"1.6.5":"Updated some textures and recipes.  "
	,"1.6.6": ""
  }
}
