{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/cyclic",
  "promos": {
    "1.16.2-latest": "0.8.2",
    "1.16.2-recommended": "0.8.2"
  },
  "1.16.2": {
  	"0.6.1":"Ported ",
  	"0.6.2":"Fixed crash in harvester GUI.  Remove logspam in Disenchanter.  Patch StackOverflowError in Excavate enchant when level is high.  Fixed projectiles thrown from items not flying.   Fan now can blow through non-solid blocks.  Fan has a GUI to control speed and range.  Beheading mob heads config list added.  Beheading enchant is able to drops skulls from wither boss equal to its level.  Fixed some resource and file not found warnings in startup console.   "
  	,"0.7.0":"Fixed 'lost connection: Took too long to log in' on servers.  Water scepter thing works on water-logged blocks.  Upgraded GUI of several blocks.  Ported from 1.12: Pharos Beacon, Creative battery, Creative item tester, Dice, Dropper, Forester, Miner, Text Projector, Uncrafter.  New blocks: Terra Preta, Mason blocks.  "
  	,"0.7.1":"All Solidifier and Melter recipes are now defined as JSON files and new recipes can be added by pack developers using the JSON format. "
  	,"0.8.0":"Flippers item added.  Items that can be turned off now have an on-off tooltip for the right-click toggle feature (currently just flippers and glove).  Haste potion added.  Fixed Powered anvil eating items.  Added config to disable power consumption; set requirement to zero for the machine.  ( vemerion ) Fix a bug where stun and swimspeed potions were brewable from any potion. ( trunksbomb: all of the following ) Fix compatibility issue with added hearts.  Correct bug with thrown direction of monster ball, add particles . Fix Harvester to harvest the correct area.    Missing hardness property causing the block to break instantly;   Missing loot table causing the block to not drop itself;   Null pointer crash when accessing the GUI due to POWERCONF not being set in Config;   Crash when placing the Collector while facing UP or DOWN (only horizontal facings are allowed).  Store UUID of User (the tile entity, not the player) in NBT . Restore missing functionality to Experience Pylon such as item interactions. "
	,"0.8.1":"Fixed foreseter crash; it now uses data tag minecraft:saplings to identify what is plantable.  ( trunksbomb ) Patchouli guidebook added.  New enchantments: Gloom, Auto Smelt, Disarming.  Battery now renders on the side how much power is stored.  Ported from 1.12: Rod of elevation; Peat Farmer; Water Candle; Vision Helmet.  Many items can now be used in midair, clicking a block not required (heart items, wings). "
  	,"0.8.2":"Trash Void now accepts fluids as it did in 1.12.  Fixed bug where Miner could get stuck on non-mineable block, or on liquid, also it sometimes would skip valid blocks.  Fluid collector now correctly pays energy cost when processing.  Fixed bug in forester where it wasnt mining the bottom log of the tree.  Fixed an issue where player would fall through Scaffolding blocks and sit inside them, they are correctly solid now.  ( trunksbomb ) New Ender enchantment for swords: what used to be block now spawns an ender pearl. "
  	,"0.8.3":"Improved the mod logger to remove log-spam; added a config to unblock that is off by default.  "
  }
}
