{
	"homepage": "https://www.curseforge.com/minecraft/mc-mods/cyclic",
	"promos": {
		"1.18.1-latest": "1.6.15",
		"1.18.2-latest": "1.7.1"
	},
	"1.18.2": {
		"1.6.0": "Ported Cyclic[1.16.5]-1.5.8 to Minecraft [1.17.1] & forge-37.0.85+.  Altered a few crafting recipes to use new items.  Removed Peat Generator (Use Peat items in Material Generator).  Removed 5 Mason blocks, replaced with Compressed Cobblestone, Flint Block.  Added Peace Candle, Translocation Platform, Stone Mattock, Crushing Macerator, and Lava Sponge.  Added Copper Tools and Amethyst Tools, Copper Lantern, Copper Chain, Copper Bars, Gold Chain, Gold Bars, Gold Lantern (Art by @shynieke).  Added Copper Nuggets and Netherite Nuggets.  Added Netherite Lanterns, chains, and bars.  Added 3 Pressure Plates: Copper Netherite and Obsidian. ",
		"1.6.1": "Enabled buckets (Do not place in world until https://github.com/MinecraftForge/MinecraftForge/issues/7922). Porting updates from [1.16.5]-1.5.10 Fix Battery energy tooltip not updating when charged in an item slot.  Added charging slot to Battery.  Fix sleeping mat bug when used in nether.  Fix Fluid cables visual disconnection when placing.  Machines that use fluid ingredients now accept fluid tags such as 'forge:experience' in place of fluid ID; updated some existing recipes on Solidifier and Evap Generator to match (old recipe JSONs still all compatible/valid).  Fixed battery energy item stack capability provider.  Refreshed texture of Air charm. Vision helmet compat with curios head slot.  Revert GPS card fixes to v1.5.6.  One recipe added to cyclic:generator_fluid for tag forge:biomass.  Default config value updated for disable_pickup on the Sack of Holding.  Add compat for Beheading enchant with the 7 Tinkers Construct mob heads (config heads are still checked last.  no changes if tinkers not installed).  ",
		"1.6.2": "Fixed recipe parsing JSON errors on server join.  Fix a bugged interaction with Settings data card and Filter data card #1970 . Torch Charm now tries to avoid placing on non-solid blocks such as top side of a bottom Slab where the torch breaks right away. ",
		"1.6.3": "Added Hunger II Potion effect with brewing stand recipe. Rebalanced a bunch of recipes and added a few new ones.  Rebalanced Launch enchant to an elytra only remake. Updated worldgen configs for the four flowers.  Fireplace block can trigger campfires",
		"1.6.4": "Garden Scythe fix visual desync when harvesting.  Monster ball now cannot capture any entity if a player is its immediate passenger (ie: saddle or using stirrups).  ",
		"1.6.5": "Updated some textures and recipes.  ",
		"1.6.6": "Fix errors in all block data saving.  Fix flowers worldgen",
		"1.6.7": "Update ru_ru.json #1986 by Bytegm. Fix doorbell button crash.  Fixed 'Material Generator Consumes Single ItemStacks with Zero FE Generation'.",
		"1.6.8": "fix wireless redstone #2001.  Fix height and settings of other machines not being set/used correctly (ex: height on Miner). ",
		"1.6.9": "Updated to forge 39.0.10.  Fix sack of holding #1999.  Add range config for spawner_seeker. Added configs for cable buffer and flow rates.  Fix patchouli guidebook recipe (patchouli_version=1.18.1-63+). Fix #2009 excavate enchant . Revert cyclic:launch enchantment changes.  Fix fluid hopper bug. Void charm now uses dimension min-y and logical-height for relative values.   ",
		"1.6.10": "Fix obsidian tool harvest level. Fix wireless transfer node loot table. Fix Crushing Macerator issue when initially loading the world (Merge pull request #2022 by jack-flash.)  Merge from jack-flash/Watering-can for #2004.    Merge pull request #2015 from Bytegm  Update ru_ru.json [1.18].  ",
		"1.6.11": "Updated to forge 39.0.66.  Merge pull request #2035 from Seniorendi:  Add config values for terra preta. Fix Crash when trying to push Cyclic item cables with create piston.  Fix red color in Battery itemstack energy bar when charged. ",
		"1.6.12": "Fix ender shelf event conflict with supplementaries:book_pile.  Empty Ender Shelf now drops item stack with no datatag.  Energy Transfer Node increased locations and capacity.  Enchantment added 'Last Stand': can prevent some lethal damage at cost of exp points, cannot combine with mending and some other leg enchants.  Cask and Tank have default recipes added to clear out fluid contents (all NBT data).  Cask now keeps fluid when harvested and placed.  Fixed scythes not harvesting tall blocks.  Tree Scythe and Brush Scythe can now be enchanted with silk touch (allows mass collection of leaf blocks and more).  Block minecraft:flowering_azalea_leaves added to data tag forge:crop_blocks.  Small fixes applied to all scythes.  Scythe of Foraging now harvests Melons and Flowering Azalea with full drops (as if it had shears or silk touch).  Fixed Reach enchant not functioning on non-chest armor slots.  Tunnel added to Shape Builder #1911.  Call 'invalidate capabilities' in block-entity machines.  Added support for using the left hand on Item User. #1994 by 'metalshark' Fixes issue #1992.",
		"1.6.13": "Fluids cyclic:honey, xpjuice, and biomass are now swim-able (uses minecraft fluid/water data tag fix. recipes continue to use fluid tags such as forge:biomass with no changes).  Fix 25x25 size label on machines.  Fix Smooth Glass not passing all light through.  Fix Gold Soul Lantern name and light level.  Fix battery error on harvesting the block.  ",
		"1.6.14": "Fixed logspam in material generator from v.13.  Fixed Battery tooltips not accurate & not charging when inside another battery thats being charged. ",
		"1.6.15": "[forge-1.18.1-39.1.2+] Fix #2038 Ender Shelves break stack connection on moving.  Fix #2055 Material generator item consumption & burn-timer sync.  Auto User bugfixes.  Auto User has two buttons for toggling left/right click and entity/block type interactions (example: empty buckets on cows with a hopper underneath).  Added Steady Body enchant.  Fix lit state on generators more consistently updating when empty (zero burn time). Added some default recipes to Material Generator.  Brush Scythe with Silk Touch enchantment fixed (vines/grass/etc).  Fix multijump not working in Anvils.  Fix Fluid Tank Fill Level Colour; so Lava and Fluid Experience and other fluids can have a custom durability color bar on fluid Tanks while carrying",
		"1.6.16": "Ported to 1.18.2.  Flowers can now be composted.  Fixed renderlayer of Copper Soul Lantern and Gold Soul Lantern.  Developed on jei=9.5.0.132 and forge=40.0.12+  ",
		"1.6.17": "Fixed fluids broken rendering & invisible.  Added solidifier recipe for putting liquid milk in buckets",
		"1.6.18": "Fix harvest scythe bug on servers.  Fixed Block Reach enchant by using Attribute Modifiers (mod compatibility).  Fixed Lava Sponge. Fixed Water Candle.  Fluid Hoppers and Cables now extract from Water Cauldron and Lava Cauldron. Item Hoppers can now insert into Composter. Update default Obsidian Pressure plate recipe.  Fix Fluid Tag recipes in Solidifier. Clean up 'Unknown recipe category' ",
		"1.7.0": "Several recipes have options to specify the Energy cost and processing time (solidifier, melter, generator_item). New content: Shields, Fireball, Basalt button, Blackstone Button, solar generator, claystone battery, Milk Bottle, Wax fluid.  Ported from 1.12.2: Magnet Block, Rainbow Cannon, Chaos Reaper, Spirit Seeker, Fire Extinguisher, Potion of Snow-walker, Potion of Waterwalking.  ",
		"1.7.1": "Added Spark. Added Entity Data Card. Carrots are now compostable. Fix Copper Pickaxe mining level not working (copper tier now correctly between stone and iron, IE copper pickaxe can mine copper ore) #2106 . Fix Filter Card Clearing #2094. ( author = mpbb )  Port Emerald and Obsidian Gear Config Options #2115  #2109 . ( author = gjeodnd12165 )  Korean Localization #2101. ( author = henkelmax ) Fix material generator not working after unloading #2104 . Fix Fan slab doesnt push inside its own block #2110  [Feature] Experience Pylon Keeps XP on Break #2114 . Fix Solidification Chamber Has No UI When A Fluid Tank Is Placed Nearby #2091. Fix Patchouli Errors #2098. Subcommand /cyclic dev random <min> <max> just returns a random int, for use with other functions. New command 'cyclic attribute (add/factor/random/reset)', adds two fixed integer modifiers to any attribute with a fixed id, does not modify base values; example /cyclic attribute forge:reach_distance add @p -1 to add/remove from reach distance (/cyclic attribute minecraft:generic.max_health random playername -5 5).  Scoreboard commands: work with existing scoreboards that you have to set up first. example: 'abc' objective already exists so EXAMPLE /scoreboard objectives add abc dummy /scoreboard objectives setdisplay sidebar abc /cyclic scoreboard random @p -4 9000 abc ; make random number and set to that objective (since /scoreboard players random is BedrockExclusive); also /cyclic scoreboard add @p -2 abc to subtract 2 from current value.  All fake-players now use the same fake profile uuid, potentially increasing performance as profiles are cached and not created (affects only Diamond Spikes and Automated User)   "
		,"1.7.2":"Fix Workbench deletes items inside when mined #2121. Fix #2119 missing dye tags in two recipes.  Fix fluid spill bug when using buckets on a tank.  Add cyan_podzol_legacy config for #2056, false by default. Fix #2122 gold bars not harvestable "
	}
}
