{
	"homepage": "https://www.curseforge.com/minecraft/mc-mods/cyclic",

	"promos": { 
		"1.16.5-latest": "1.5.21",
		"1.18.2-latest": "1.7.17",
		"1.19.2-latest":"1.8.2",
		"1.19.3-latest":"1.9.0",
		"1.19.4-latest":"1.10.2",
		"1.20.1-latest":"1.12.3"

	},
	"1.16.5": {
		"0.6.1": "Ported ",
		"0.6.2": "Fixed crash in harvester GUI.  Remove logspam in Disenchanter.  Patch StackOverflowError in Excavate enchant when level is high.  Fixed projectiles thrown from items not flying.   Fan now can blow through non-solid blocks.  Fan has a GUI to control speed and range.  Beheading mob heads config list added.  Beheading enchant is able to drops skulls from wither boss equal to its level.  Fixed some resource and file not found warnings in startup console.   ",
		"0.7.0": "Fixed 'lost connection: Took too long to log in' on servers.  Water scepter thing works on water-logged blocks.  Upgraded GUI of several blocks.  Ported from 1.12: Pharos Beacon, Creative battery, Creative item tester, Dice, Dropper, Forester, Miner, Text Projector, Uncrafter.  New blocks: Terra Preta, Mason blocks.  ",
		"0.7.1": "All Solidifier and Melter recipes are now defined as JSON files and new recipes can be added by pack developers using the JSON format. ",
		"0.8.0": "Flippers item added.  Items that can be turned off now have an on-off tooltip for the right-click toggle feature (currently just flippers and glove).  Haste potion added.  Fixed Powered anvil eating items.  Added config to disable power consumption; set requirement to zero for the machine.  ( vemerion ) Fix a bug where stun and swimspeed potions were brewable from any potion. ( trunksbomb: all of the following ) Fix compatibility issue with added hearts.  Correct bug with thrown direction of monster ball, add particles . Fix Harvester to harvest the correct area.    Missing hardness property causing the block to break instantly;   Missing loot table causing the block to not drop itself;   Null pointer crash when accessing the GUI due to POWERCONF not being set in Config;   Crash when placing the Collector while facing UP or DOWN (only horizontal facings are allowed).  Store UUID of User (the tile entity, not the player) in NBT . Restore missing functionality to Experience Pylon such as item interactions. ",
		"0.8.1": "Fixed foreseter crash; it now uses data tag minecraft:saplings to identify what is plantable.  ( trunksbomb ) Patchouli guidebook added.  New enchantments: Gloom, Auto Smelt, Disarming.  Battery now renders on the side how much power is stored.  Ported from 1.12: Rod of elevation; Peat Farmer; Water Candle; Vision Helmet.  Many items can now be used in midair, clicking a block not required (heart items, wings). ",
		"0.8.2": "Trash Void now accepts fluids as it did in 1.12.  Fixed bug where Miner could get stuck on non-mineable block, or on liquid, also it sometimes would skip valid blocks.  Fluid collector now correctly pays energy cost when processing.  Fixed bug in forester where it wasnt mining the bottom log of the tree.  Fixed an issue where player would fall through Scaffolding blocks and sit inside them, they are correctly solid now.  ( trunksbomb ) New Ender enchantment for swords: what used to be block now spawns an ender pearl. ",
		"0.8.3": "Auto-Smelting enchantment can now be applied to other mining tools such as Axes.  Updated pachoulli guidebook with more entries.  Emerald tools now use sticks instead of diamonds.  Used player->floatingTickCount to prevent player from being 'kicked for flying' when using climbing and levitating objects such as Fan, Air charm, etc.  Cyan Rose now spawns in the following biome-types: FOREST, PLAINS, TAIGA, EXTREME_HILLS.  Improved the mod logger to remove log-spam; added a config to unblock that is off by default.  ( trunksbomb ) Added Fireplace block.  Added Crafting Machine.  Added Ender Scepter.  Added Caving Torch Charm.",
		"0.9.0": "Removed the config toggles that un-register items, this is not supported by mojang or forge it simply throws MissingMappings crash exceptions (to remove content, delete recipes in a data pack and hide from JEI).  Terra Preta no longer works on blocks that are immune to bonemeal (if they have canUseBonemeal() -> false).  Shape builder update: optional shape slot and GPS slot, the GPS slot will change the center of the target build, default is still the machine; the shape slot will READ in the current shape while the machine is running (break and replace existing machines).  New Shape computer added to write builds in the world onto data cards.Shape data card can build structures in the world relative to the player Harvest Scythe added.  Ender enchantment updated so it will not shoot the pearl if you successfully open a chest.  Added settings data card item. Renamed GPS Marker to GPS Data Card.  Added ender carrot.   Added chocolate, honey, and metal apples.   Added more default honey recipes.  Fixed fan transparency bug.  Fan GUI updated.  Fixed bug where Peat generator was eating items when full.  Beekeeper enchant added.  ( trunksbomb ) Fixed Experience Enchant triggers when enchanted item is held in the offhand and blocks are broken with the mainhand. ",
		"0.9.1": "Hotfix for server crash",
		"0.9.2": "Fixed Empty Heart Container error.  Fixed Text Projector not working on servers.  Fixed the buttons in Item Collector not showing their status.  Fixed crash caused by death; related to experience boost enchant ( thanks henkelmax ) ",
		"0.9.3": "Fix Item collector rendered region not matching pickup area.  More recipes use data tags instead of items (example: forge:leather, forge:string, forge:slimeballs). Updated some internal power transfer logic to avoid client-server desync.  Fix Disenchanter energy cost.  Fixed automated Users syncing/consuming items such as buckets.  Slight power buff to Excavation enchant.  ( trunksbomb ) Fix client desync of applied potion effect on Gloom.  Fix crash when releasing mobs with NBT data from Monster Ball.   Fix server crash due to recursion from Excavation Enchant activating, and check harvestlevel of each blockstate.  Add ability to extract honeycomb from hives and nests to Cyclic-added shears  ",
		"0.9.4": "Added config options to disable any enchantment.  Cyan flower worldgen feature is now registered in the Feature registry (mod compatibility).  Fixed bug where players cannot input 'e' in the text projector.  Harvester now works with crops from the Resynth mod.  Fixed Excavate enchant not working on redstone ore.  Add User power config option.  Added workaround to force User to work with some Mystical Agriculture tools.  ( trunksbomb ) Fix Issue #1604, Forester only tried to harvest blocks if its inventory was empty.  Fix Harvester breaking stems for pumpkins, melons, etc. Fix Monster Ball not waking up sleeping entity. ",
		"0.10.0": "Laser Cell port from 1.12.  Improved bounding-boxes of some blocks. Spikes block now have their baseplate take up the full block instead of being a bit too small to fill the full blockspace.  Fixed emerald carrot not affecting horses jump height.  Fishing Net has a GUI added by request.  ( trunksbomb ) New unbreakable bedrock with custom texture, control with redstone.  Magnet enchant is now compatible with Botania 'solegnolia'.  Solid Ender Eye now works with the customized strongholds from 'Repurposed Structures' mod.  Fixed compatibility with inventory-sorting mods such as Inventory Tweaks. ( BugmanBugman ) Capitalize the names of some items in en_us lang",
		"0.10.1": "Added Crafting Stick and Advanced Crafting Stick.  ( trunksbomb ) Ported Storage Bag.  Ported Ender Shelf and Ender Shelf Controller.  ",
		"1.0.0": "Added Ghost Block and Phantom Block.  Fixed the JEI '+' button compatibility with Solidifier recipes.  Experience Pylon: When sneaking on top to deposit XP into the pylon, it pulls MUCH faster when your level is higher, and slower at lower levels; and it ignores the on/off state, and fix button getting stuck.  Fixed Magma anvil not functioning/repairing.  Fixed game crash in Terra Preta block.  Items/charms that teleport the player now respect the EnderTeleportEvent cancellation logic.  Harvester optimized to run more slowly, (run 1 time every 10 ticks, instead of 16 times in a single tick).  Added Ender Trigger and Ender Anchor.  The Sack of Holding (cyclic:tile_transporter) bag now has a config list of blocks to disable pickup (Spawners are defaulted in this list).  Config file entries added for Uncrafter: ignore list, NBT flag, timer.  Crafting Sticks have dartcraft-stype buttons to empty and balance the grid.  Add power consumption of cyclic:structure block to config.  Fix beheadingEntityMHF config loading.   ( trunksbomb )  Ported Workbench. Ported  Antimatter Evaporator.",
		"1.0.1": "Excavation harvest level logic fixed not being able to excavate many combinations (such as Terracotta with pickaxe), relies now on ForgeHooks.canHarvestBlock.  ( trunksbomb ) Fix server crashes for Storage Bag and Workbench. ",
		"1.0.2": "Fluid cables can extract from waterlogged blocks and fluid source blocks.  Fix Workbench crashes with Empty grid button from some server modpack. Fix concurrency crash from Caving Torch.  Fixed transparency block rendering while underwater using shouldDisplayFluidOverlay().  ",
		"1.1.0": "Harvester now processes in a linear fashion instead of picking a random spot to harvest each tick, so it runs faster overall (uses Forester logic).  Solidifier and Crafter machines are now side-agnostic; no sides are input-only or output-only.  All Gui Sliders now have mousewheel support.  Ender Wings can be activated within your inventory with a right click, as another option other than holding and swinging it around.  Fix Item Collector sometimes not grabbing from the border and having lopsided region.  Added a 'size' slider to three machines (Harvester, Forester, Item Collector) that work on target regions. Fixed harvester preview button.  Added conveyors block (please provide feedback, they will get improvements as time goes on).  Fixed Excavation enchant crash with some insta-break tools.  Improved how Excavation enchant works with diagonals.  Fix enchantment configs.  Fluid cables in extraction mode can now pickup any source fluid, not only water. ",
		"1.1.1": "Disenchanter can now be automated; added a second output slot and restricted automated IO slots.  Add item data tag 'cyclic:disenchanter_immune' to block items from being disenchanted, default value includes quark:ancient_tome.  Excavation enchant is now compatible with Fortune.  Refactor sounds to use the new ForgeSoundType system for compatibility.  Upgrade data tags for compatibility: instead of custom cyclic tags, use forge tags (forge:vines, forge:plants, forge:mushrooms, forge:crop_blocks, forge:fishing_rods).  Forester now only tries to place on the top side of a block (facing down) which keeps the saplings inside the boundary when logs are in the way.  ( MichaelNZ404 ) Fix Enriched Peat being consumed when energy buffer is full.  Fix Ender Shelf compatibility with automated users.  Endershelf no longer drops stacked enchants when broken.  Fix items sometimes getting stuck in cables.    ",
		"1.1.2": "Fixed peat generator.  Fix serverside Teleporter wand crash.  Fix disenchanter itemslot bug.  Fix peat farm loot table.   Fix Multiple storage bag bugs with pickup mode   ",
		"1.1.3": "Optimize harvester.  Update Storage Bag getShareTag for sync issue . Fix crafter shaped recipes ",
		"1.1.4": "Fixed bugs when shift-clicking into the crafter.  Fixed Client not being able to join Servers (reverted to functional 1.1.2 state, removed bug introduced in 1.1.3).  Harvester bugfix: disable getSeedsItem accesstransformer.  Bump to 1.16.5  . ( BlueAgent ) Fix Solidifier recipe automation and JEI integration. Fix Uncrafter bug with empty container items such as buckets in some recipes.  (  MichaelNZ404 )  changed ingame manual text to reflect changed behaviour for Conveyors. ",
		"1.1.5": "Harvester seed logic updated.  Item Collector now has height control.  Miner and Item Collector now have up-down toggles.  Fix scythe server desync.  Alternate Dry Peat Bog recipes added.  New config added to control the maximum hearts gained with the item.  When both Fortune and Excavate are applied to a tool, the fortune bonus now applies to every block broken not just the first.  Minimum required forge version is 1.16.4-35.1.22.    ( BlueAgent ) Disenchanter and Uncrafting containers.  Fix uncrafter not consuming inputs. ",
		"1.1.6": "Crafttweaker compatibility added for melter and solidifier to add/remove existing json recipes.  Example at https://github.com/Lothrazar/Cyclic/tree/trunk/1.16/crafttweaker ",
		"1.1.7": "Fixed a dupe bug.  Fixed some lists in config file resetting and not loading from the file.  Fishing net now uses forge:chests/tagged data tag for compatible recipes.  Thrown torches now get placed inside, instead of above, material that is replacable such as snow layers.  New Uncrafter config 'ignore_recipes', similar to the existing 'ignore_list' but this one lets you use the ID of a specific recipe (for example, if one item has three recipes to craft it, you can now block two of the recipes so the uncrafter will still find and use that third recipe).  Uncrafter now halts when full. ",
		"1.1.8": "Wireless Transmitter fix: Processing no longer halts on empty slots.  Fixed IO automation on both anvils, so the input slot cannot be extracted by a hopper.  Fixed 'unable to resolve texture' errors in startup logs.  Fixed Terra Preta not affecting most crops, also increased its growth rate.  Ender Shelf can now accept books from your offhand; also it no longer deletes books with too many enchantments.  Ender Shelf Controller can accept enchanted books with multiple chants when added by holding player.  Disabled the '+' JEI hook for Crafting machine, as due to an API change it was deleting items.  Pharos beacon now compatible with 'RandomPatches' modified potions.  ",
		"1.1.9": "cyclic:workbench block added to forge:workbenches tag. Some recipes use forge:glass tag instead of minecraft:glass.  Melter now supports 1x1 recipes, added 9 recipes inside the Melter.  Fix CT Recipes aren't updated on reload jaredlll08.  Fix bag pickup crash by BlueAgent.  Fix Always sync user held item by BlueAgent.    ",
		"1.2.0": "Fixed Uncrafter item dupe bug introduced in a very recent version.  Melter: Magma now melts into 1k per block instead of 500.  Curse enchant no longer triggers against forge FakePlayers (machines that attack for example).  Fixed Growth enchant restricted to only hoes, and lowered its rarity.  Tags added to all fluids, for example 'cyclic:honey' fluid is now tagged as fluid #forge:honey.  Cables can now extract from multiple places at once, not only a single one.  Fixed wrench tags to use 'forge:tools/wrench' for compatibility.  Cables now respond to any item that is a 'forge:tools/wrench', even from other mods.  Cable Wrench updated: no more attacking to swap modes; instead use the normal interaction click and it goes through normal-extract-blocked in a loop.  ",
		"1.2.1": "Fixed a double-click mouse bug on Crafting Machine GUI.  The fluid cyclic:xpjuice now has the TAG forge:experience so its compatible with other mods using this tag.  New worldgen config to disable flower_cyan from generating at all.",
		"1.2.2": "Balance change: Slime balls now melt into 250 fluid, up from 100 (future compat with tinkers construct green slime).  Fixed Mattock not registering its ToolType correctly.  Crate upgraded to now keep its inventory when broken.  Updated item model for cables.  Fixed recipe loading and unloading logic (CraftTweaker can now remove melter and solidifier recipes; script commands unchanged.  JSON recipes not affected.  Tiles possibly more efficient).  Fixed missing texture when conveyors are dyed white.  Fix Ender Shelf text going light blue when night vision is used.  Ender Shelf Controller item capability has been fixed, meaning its now compatible with storage systems (storage network, RS, etc). ",
		"1.2.3": "Fixed Spawner Seeker can get locked up on server.  Fixed fluid cables disconnecting when they are in extract mode and a nearby block updates.  Fixed cables sometimes being non-solid in when in extraction mode.  ",
		"1.2.4": "Solidifier recipes updated to now be shapeless, so automation is easier.   Crafting machine secondary output -such as empty bottles and buckets- now goes to output slot (fix by shatulsky on github).  Charms and Auto torches can now be turned on-off with right click similar to Flippers and climbing glove, shows in tooltip.  Fixed ConcurrentModificationException error in Caving Torch.  Fix AutoCaveTorchItem to only place torches on valid surfaces (PR by  vemerion)   ",
		"1.2.5": "Update Crafting machine again from 1.2.4, for recipes with container items (empty buckets or essence crystals).  Wireless redstone now has a heplful rendering option. ",
		"1.2.6": "Added two new blocks that mimic other blocks Concentrated glowstone and Concentrated soundproofing.  Build scepters now render the block being used on the cross-hair.  Added Ender Apples to find structures, and apples of chorus, bone, and prismarine for other effects (and moved some textures in the rp).  ",
		"1.2.7": "Fix server startup crash introduced in 1.2.6",
		"1.2.8": "Added Filter Card item.  Item/Fluid cable when in extraction mode has a GUI screen to accept a filter card for custom routing.  Fixed Crafting stick buttons sometimes wiping out NBT data of items.  Improved wooden wrench block rotation.  Energy cable capacity increased from 8k to 32k.  Energy cable now has functional extractors (use wrench).  Ender Shelf now saves its content in the item when broken and replaced.  Merged PR from Pelotrio; added com.lothrazar.cyclic.api.IHarvesterOverride by PR from InfinityRaider.  Fix Conveyor saving invalid speed block property value in some locales.  Fix Antimatter evaporator voids waterlogged blocks.   ",
		"1.2.9": "Fix cables not updating clientside to show connections to containers.  Fix Antimatter Evaporator nuking non-fluid blocks when in generic mode.  Fix ender shelf controller not accepting books (if issues persist break and place your controller in a new location).  ",
		"1.2.10": "Fixed item cables not dropping their contents when items get stuck or backed up and cables are broken.  Fixed items still flowing into containers through blocked cables (yellow square state).  Fixed the GUI Filter screen not opening for Item cables while in extract mode (to filter items).  Fixed english localization of some items.  Added config file entries for armor toughness, weapon damage, for crystal obsidian and emerald. Fixed the Filter Data Card tooltips not showing while on a server. ",
		"1.2.11": "Fix NullPointerException error relating to FilterCardItem on server.  Fix Block Placer gui broken.  ",
		"1.3.0": "Added blocks: Shearing Station, Terra Glass, Moon Detector, Weather Detector, Simple Hopper, Clay Fluid Hopper, Golden Hopper, Fan Slab, Block Rotator, Void Anvil, Sprinkler.  Added items Glistering and Corrupted Chorus, Blockstate Data Card (used with Miner).  Added/ported 18 charm items (curios/baubles).  Update ru_ru.json by Bytegm.  Updated some Textures.  Updated Filter Data Card now works in a new item slot in Item Collector screen.  Update to Gem recipes x2.  Update to Evoker Fang add 10 tick cooldown.  Fix: Patch an obscure PacketItemStackNBT hole that hacked clients could exploit.  Fix Filter Data stacking, duplicating, and being able to place inside itself.  Fix honey apple tooltip.  Increased creative battery power transfer rate.  Fix shape data card tooltip.  "
		,"1.3.1":"Added a catch handler in Ender Apple, if a modded structure isnt responding, or it triggers Server Watchdog errors.  Added Ring of Experience and Cursed Ring of Experience.  Added new configs for armor damage reduction (emerald, obsidian) with slightly changed default values.  Experience fluid now has light level 8.  Experience Pylons, if empty, will accept any fluid tagged with forge:experience (it will convert to the cyclic XP fluid of the same tag on world save and reload).  "
		,"1.3.2":"Fix various log file errors (sounds, blockstates, texture mip etc).  Fixed autocomplete help for /cyclic sub-commands.  Compatibility fix: If a mod uses coremods/mixins to break vanilla hoppers (better hoppers+, etc), in a non-compatible way, then instead of crashing the game cyclic will log the error and revert the bounding box of Cyclic's hoppers to full cube.  Fixed missing texture on Sprinkler block.  Guidebook now mentions maximum flow rates for cables.  Improved visuals on certain Conveyor block models. "
		,"1.3.3":"Fix arrows shot from the multi-shot enchantment not shooting (not getting velocity).  Add config file entries for charm_speed, charm_luck, charm_attackspeed, and reduce default luck value from 100 to 10. Fix Antimatter Evaporator not affecting flowing (non-source) water.  Fix sound effects on some tools not playing (becoming more consistent with 1.12.2).  Fix some charms (curios) not taking durability damage when used/triggered.  "
		,"1.3.4":"Ported Inverted Stirrups and Diamond Spikes from 1.12.2.  Added new wooden Item version of the ender shelf, stores any item.  Fix Storage Bag losing items sometimes on player-server re-connection.  Sneak-right click any wrench against a cyclic Cable and it will get harvested.  Void anvil now produces experience fluid while processing (extra fluid is voided internally, control in config).  Disenchanter now consumes experience fluid while processing (disable in config, or make it produce fluid).  Command updates /cyclic gamemode, glowing, gravity, dev. Blockstate data card now avoids saving duplicate blocks in the filter list (its the yellow card for the Miner).  Added new variant of Tempered Dark Glass with connected textures using block states.  Ender Shelf controller improved how it connects to nearby shelves; also tries to wrap around corners.  Each shelf caches/optimizes the enchant display name on client side, and the enchantment id serverside per stack, to optimize fps/tps use.  Use wrench on shelf or controller to toggle ender shelf rendering style. Update ru_ru.json by Bytegm "
		,"1.3.5":"Fix NPE error with Optifine and Ender shelf.  Fix Fluid cable compatibility serer error with the 'tanknull'.  Blockstate data card now has the option to crouch and match only the block, ignoring the blockstate (default not crouching matches the exact state); tooltips updated.  PR: clarified info on fishing net for en_us #1889 by faizjami.  PR:  Various Caving Torch Charm fixes #1888 by mcpower "
		,"1.3.6":"Fixed Rotator on pillar type blocks with axis properties (logs, purpur pillar, etc).  Fix Mattock mining bug.  Updated some of the default curios data tags so gear is more equippable. Update tooltips on some empty fluid tanks when fluid required is Experience.  Merged Allow shears to work in a dispenser #1898 by ChiriVulpes.  Merged Completely overhaul Caving Torch Charm logic #1892 by mcpower.  Fix Game breaking when placing diamond spikes.  Updated logic to prevent excavation and experience_boost enchants to appear together naturally.  Add some conditional fluid based recipes that will load only if https://www.curseforge.com/minecraft/mc-mods/liquid-blocks mod is installed (see datapack /cyclic/recipes/liquidblocks/).  Monster capsule no longer fragile, an empty Monster Ball is returned when an entity is successfully released.  Updated tags of some modded blocks such as BoP and Quark blocks (see tags in forge: mushrooms, plants, vines)  "
		,"1.3.7":"Fix block-forge:plants datapack error"
		,"1.3.8":"Prevent the game from crashing when attempting to use Ender Scepter (cyclic:teleport_wand) while riding in a minecart.  Fix Shape Builder crashing when its given an empty card and the machine is powered on.  Fix item loss bug in Item Shelf.  Update data tags forge:fishing_rods and forge:books (see /cyclic dev tags to debug items).  Fix Fluid Cables sometimes not extracting from fluid blocks or certain tanks  "
		,"1.4.0":"Ported from 1.12.2: Doorbell, Ore Prospector, Ender Book, Energy transfer node, Item transfer node.  "
		,"1.4.1":"Dont load auto_smelt loot modifier if enchant is disabled in config.  Update Ghost and Phantom block textures by Lylythii.  Fix server crash in Moon Phase Detector.  Fix Item shelf letting you place blocks when trying to deposit or swap items.  Fix some missing guidebook text mappings.  Fix quickdraw affecting offhand item.  Fixed cyclic:multishot enchantment and renamed to Mult-Bow.  "
		,"1.4.2":"Name your GPS Card in an Anvil to have your home name displayed in the Ender Book interface.  New cyclic-client.toml config file.  Enabled ability to insert fluids from Solidifier directly from items like Buckets in your hand.  Add recipe 'cyclic:solidifier_slimeblock'.  Solidifier now tries to reset its timer if recipe is not found.  Update a few recipes to use 'forge:slimeballs' tag as ingredient instead of item, and added a slimeball->magmacream recipe id 'cyclic:solidifier_magmacrea_single'.  Hoppers/pipes can no longer pull out of Workbench.  Fix 'Slot 1 not in valid range' for Miner.  Added Information tab to most Cyclic items; text is read from the same language entry as the Guide Book.  Added RF/tick tooltips to peat fuel items.  Harvester now has HEIGHT slider.  Ported potion recipes from 1.12.2:  Levitation, Blindness, Hunger, Wither, Resistance. "
		,"1.5.0":"Ender Shelf counts as a Bookshelf for enchantment tables.  Some new textures for existing items updated by Lylythii#3827.  All Cables and a few other blocks can now be water-logged. Fluid cables have extra tooltips to explain how they also can pull fluid sources from the world.  Fixed bug where fluid cables would delete water logged blocks instead of drying them out.  Ported from 1.12.2: Slingshot, Inventory cake, Wing Charm (renamed to Parachute Pauldrons), Apple of Lofty Stature, Fluid Transfer Node, Packager, Spawn Inspector.  New blocks added: Sound Recorder, Sound Player, Combustion Generator, Devouring Generator, Evaporation Generator, Material Generator, Membrane Block, Waxed Lamp, Rich Soil, Cloud Block, Phantom Cloud Block. "
		,"1.5.1":"Fixed water-loggable blocks such as cables not interacting with player buckets.  Fixed Terra Glass not detecting skylight at high y-values in the overworld.  Added some more hardcoded properties to cyclic.toml config.  Fixed Packager showing empty recipes in JEI (requires jei-7.7.1.122+).  Packager will no longer try to craft Iron Trapdoors and Boots.  "
		,"1.5.2":"Fix packager jei error recipes in logs (may only happen with certain jei versions)"
		,"1.5.3":"Deleted 'PlayerEvent.SaveToFile' log spam.  Parachute Pauldrons will no longer trigger when turned off.  Advanced Crafting stick now correctly syncs its inventory when crafting and/or closing the window. Fixed bug when workbench saves and closes.  PR from TelepathicGrunt Honey Bucket added to forge item tag of 'forge:buckets/honey' for compatibility with Create (fluid and block tags unchanged).  Fix typo in guidebook"
		,"1.5.4":"Copy arrows created from the Multi-Bow (bow multishot) enchantment are now DISALLOWED from pickup, you can only pickup the center of the three arrows.  Fix item transfer node not dropping GPS card when broken.  Fixed harvesting a cable with a wrench while stuck crouched under a slab.  Fix Fluid Hopper Deletes Water Logged Blocks.  Fix Fluid Cable export filter data cards not dropping when broken. Changed some default values in uncrafter config. Removed getMinEnchantability check on Experience Boost enchant, which blocked it from showing up in the Enchantment Table for most tools.  Enchantment rarity changes: multishot VERY_RARE -> UNCOMMON, beheading: COMMON -> RARE, Traveller: VERY_RARE -> RARE. "
		,"1.5.5":"Fix Sprinkler not growing crops and increased growth rate.  Fix Solidifier not accepting fluids that were already correctly tagged such as forge:honey.  Fix some incorrect JEI Info guide tab text. "
		,"1.5.6":"All cables now build correctly with Construction Wands mod.  Fixed fluid levels in GUI screens not showing contained values (desync of disenchanter, etc). Excavate enchant will no longer damage unbreakable tools (example: Supremium Paxel). Changed order of operations for EnderBook dimension transit (call player.changeDimension and attempt to allow chunk to load so player wont fall thru blocks). "
		,"1.5.7":"GPS Card allows you to pick the empty offset position if you crouch while using.  Ender Book now tries to move you up if you are about to TP into a solid block, also it applies slowfall for 1 second after landing. "
		,"1.5.8":"Revert GPS card change, works on all machines and blocks regardless of crouching/sneaking state (instead offset is only when jumping/falling).  Merge #1951 Gui Facelift with new Progress bar. Fix bugfix where the evaporation generator would only burn for 1 tick unless it got more than 1 bucket inserted at a time : Shadows-of-fire.  "
		,"1.5.9":"Fix Battery energy tooltip not updating when charged in an item slot.  Added charging slot to Battery.  Fix sleeping mat bug when used in nether.  Fix Fluid cables visual disconnection when placing.  "
		,"1.5.10":"Machines that use fluid ingredients now accept fluid tags such as 'forge:experience' in place of fluid ID; updated some existing recipes on Solidifier and Evap Generator to match (old recipe JSONs still all compatible/valid).  Fixed battery energy item stack capability provider.  Refreshed texture of Air charm. Vision helmet compat with curios head slot.  Revert GPS card fixes to v1.5.6.  One recipe added to cyclic:generator_fluid for tag forge:biomass.  Default config value updated for disable_pickup on the Sack of Holding.  Add compat for Beheading enchant with the 7 Tinkers Construct mob heads (config heads are still checked last.  no changes if tinkers not installed).  "
		,"1.5.11":"Fix a bugged interaction with Settings data card and Filter data card #1970 . Torch Charm now tries to avoid placing on non-solid blocks such as top side of a bottom Slab where the torch breaks right away. "
 
		,"1.5.12":"PR #1976 by metalshark :Item, Energy, and Fluid Cables now have Increased performance (compile time optimisations, reduction in cyclomatic complexity and removal of redundant checks) "


	},
	"1.18.2": {
		"1.6.0": "Ported Cyclic[1.16.5]-1.5.8 to Minecraft [1.17.1] & forge-37.0.85+.  Altered a few crafting recipes to use new items.  Removed Peat Generator (Use Peat items in Material Generator).  Removed 5 Mason blocks, replaced with Compressed Cobblestone, Flint Block.  Added Peace Candle, Translocation Platform, Stone Mattock, Crushing Macerator, and Lava Sponge.  Added Copper Tools and Amethyst Tools, Copper Lantern, Copper Chain, Copper Bars, Gold Chain, Gold Bars, Gold Lantern (Art by @shynieke).  Added Copper Nuggets and Netherite Nuggets.  Added Netherite Lanterns, chains, and bars.  Added 3 Pressure Plates: Copper Netherite and Obsidian. ",
		"1.6.1": "Enabled buckets (Do not place in world until https://github.com/MinecraftForge/MinecraftForge/issues/7922). Porting updates from [1.16.5]-1.5.10 Fix Battery energy tooltip not updating when charged in an item slot.  Added charging slot to Battery.  Fix sleeping mat bug when used in nether.  Fix Fluid cables visual disconnection when placing.  Machines that use fluid ingredients now accept fluid tags such as 'forge:experience' in place of fluid ID; updated some existing recipes on Solidifier and Evap Generator to match (old recipe JSONs still all compatible/valid).  Fixed battery energy item stack capability provider.  Refreshed texture of Air charm. Vision helmet compat with curios head slot.  Revert GPS card fixes to v1.5.6.  One recipe added to cyclic:generator_fluid for tag forge:biomass.  Default config value updated for disable_pickup on the Sack of Holding.  Add compat for Beheading enchant with the 7 Tinkers Construct mob heads (config heads are still checked last.  no changes if tinkers not installed).  ",
		"1.6.2": "Fixed recipe parsing JSON errors on server join.  Fix a bugged interaction with Settings data card and Filter data card #1970 . Torch Charm now tries to avoid placing on non-solid blocks such as top side of a bottom Slab where the torch breaks right away. ",
		"1.6.3": "Added Hunger II Potion effect with brewing stand recipe. Rebalanced a bunch of recipes and added a few new ones.  Rebalanced Launch enchant to an elytra only remake. Updated worldgen configs for the four flowers.  Fireplace block can trigger campfires",
		"1.6.4": "Garden Scythe fix visual desync when harvesting.  Monster ball now cannot capture any entity if a player is its immediate passenger (ie: saddle or using stirrups).  ",
		"1.6.5": "Updated some textures and recipes.  ",
		"1.6.6": "Fix errors in all block data saving.  Fix flowers worldgen",
		"1.6.7": "Update ru_ru.json #1986 by Bytegm. Fix doorbell button crash.  Fixed 'Material Generator Consumes Single ItemStacks with Zero FE Generation'.",
		"1.6.8": "fix wireless redstone #2001.  Fix height and settings of other machines not being set/used correctly (ex: height on Miner). ",
		"1.6.9": "Updated to forge 39.0.10.  Fix sack of holding #1999.  Add range config for spawner_seeker. Added configs for cable buffer and flow rates.  Fix patchouli guidebook recipe (patchouli_version=1.18.1-63+). Fix #2009 excavate enchant . Revert cyclic:launch enchantment changes.  Fix fluid hopper bug. Void charm now uses dimension min-y and logical-height for relative values.   ",
		"1.6.10": "Fix obsidian tool harvest level. Fix wireless transfer node loot table. Fix Crushing Macerator issue when initially loading the world (Merge pull request #2022 by jack-flash.)  Merge from jack-flash/Watering-can for #2004.    Merge pull request #2015 from Bytegm  Update ru_ru.json [1.18].  ",
		"1.6.11": "Updated to forge 39.0.66.  Merge pull request #2035 from Seniorendi:  Add config values for terra preta. Fix Crash when trying to push Cyclic item cables with create piston.  Fix red color in Battery itemstack energy bar when charged. ",
		"1.6.12": "Fix ender shelf event conflict with supplementaries:book_pile.  Empty Ender Shelf now drops item stack with no datatag.  Energy Transfer Node increased locations and capacity.  Enchantment added 'Last Stand': can prevent some lethal damage at cost of exp points, cannot combine with mending and some other leg enchants.  Cask and Tank have default recipes added to clear out fluid contents (all NBT data).  Cask now keeps fluid when harvested and placed.  Fixed scythes not harvesting tall blocks.  Tree Scythe and Brush Scythe can now be enchanted with silk touch (allows mass collection of leaf blocks and more).  Block minecraft:flowering_azalea_leaves added to data tag forge:crop_blocks.  Small fixes applied to all scythes.  Scythe of Foraging now harvests Melons and Flowering Azalea with full drops (as if it had shears or silk touch).  Fixed Reach enchant not functioning on non-chest armor slots.  Tunnel added to Shape Builder #1911.  Call 'invalidate capabilities' in block-entity machines.  Added support for using the left hand on Item User. #1994 by 'metalshark' Fixes issue #1992.",
		"1.6.13": "Fluids cyclic:honey, xpjuice, and biomass are now swim-able (uses minecraft fluid/water data tag fix. recipes continue to use fluid tags such as forge:biomass with no changes).  Fix 25x25 size label on machines.  Fix Smooth Glass not passing all light through.  Fix Gold Soul Lantern name and light level.  Fix battery error on harvesting the block.  ",
		"1.6.14": "Fixed logspam in material generator from v.13.  Fixed Battery tooltips not accurate & not charging when inside another battery thats being charged. ",
		"1.6.15": "[forge-1.18.1-39.1.2+] Fix #2038 Ender Shelves break stack connection on moving.  Fix #2055 Material generator item consumption & burn-timer sync.  Auto User bugfixes.  Auto User has two buttons for toggling left/right click and entity/block type interactions (example: empty buckets on cows with a hopper underneath).  Added Steady Body enchant.  Fix lit state on generators more consistently updating when empty (zero burn time). Added some default recipes to Material Generator.  Brush Scythe with Silk Touch enchantment fixed (vines/grass/etc).  Fix multijump not working in Anvils.  Fix Fluid Tank Fill Level Colour; so Lava and Fluid Experience and other fluids can have a custom durability color bar on fluid Tanks while carrying",
		"1.6.16": "Ported to 1.18.2.  Flowers can now be composted.  Fixed renderlayer of Copper Soul Lantern and Gold Soul Lantern.  Developed on jei=9.5.0.132 and forge=40.0.12+  ",
		"1.6.17": "Fixed fluids broken rendering & invisible.  Added solidifier recipe for putting liquid milk in buckets",
		"1.6.18": "Fix harvest scythe bug on servers.  Fixed Block Reach enchant by using Attribute Modifiers (mod compatibility).  Fixed Lava Sponge. Fixed Water Candle.  Fluid Hoppers and Cables now extract from Water Cauldron and Lava Cauldron. Item Hoppers can now insert into Composter. Update default Obsidian Pressure plate recipe.  Fix Fluid Tag recipes in Solidifier. Clean up 'Unknown recipe category' ",
		"1.7.0": "Several recipes have options to specify the Energy cost and processing time (solidifier, melter, generator_item). New content: Shields, Fireball, Basalt button, Blackstone Button, solar generator, claystone battery, Milk Bottle, Wax fluid.  Ported from 1.12.2: Magnet Block, Rainbow Cannon, Chaos Reaper, Spirit Seeker, Fire Extinguisher, Potion of Snow-walker, Potion of Waterwalking.  ",
		"1.7.1": "Added Spark. Added Entity Data Card. Carrots are now compostable. Fix Copper Pickaxe mining level not working (copper tier now correctly between stone and iron, IE copper pickaxe can mine copper ore) #2106 . Fix Filter Card Clearing #2094. ( author = mpbb )  Port Emerald and Obsidian Gear Config Options #2115  #2109 . ( author = gjeodnd12165 )  Korean Localization #2101. ( author = henkelmax ) Fix material generator not working after unloading #2104 . Fix Fan slab doesnt push inside its own block #2110  [Feature] Experience Pylon Keeps XP on Break #2114 . Fix Solidification Chamber Has No UI When A Fluid Tank Is Placed Nearby #2091. Fix Patchouli Errors #2098. Subcommand /cyclic dev random <min> <max> just returns a random int, for use with other functions. New command 'cyclic attribute (add/factor/random/reset)', adds two fixed integer modifiers to any attribute with a fixed id, does not modify base values; example /cyclic attribute forge:reach_distance add @p -1 to add/remove from reach distance (/cyclic attribute minecraft:generic.max_health random playername -5 5).  Scoreboard commands: work with existing scoreboards that you have to set up first. example: 'abc' objective already exists so EXAMPLE /scoreboard objectives add abc dummy /scoreboard objectives setdisplay sidebar abc /cyclic scoreboard random @p -4 9000 abc ; make random number and set to that objective (since /scoreboard players random is BedrockExclusive); also /cyclic scoreboard add @p -2 abc to subtract 2 from current value.  All fake-players now use the same fake profile uuid, potentially increasing performance as profiles are cached and not created (affects only Diamond Spikes and Automated User)   "
		,"1.7.2":"Fix Workbench deletes items inside when mined #2121. Fix #2119 missing dye tags in two recipes.  Fix fluid spill bug when using buckets on a tank.  Add cyan_podzol_legacy config for #2056, false by default. Fix #2122 gold bars not harvestable "
		,"1.7.3":"New content: Added Lunchbox, Potion Sponge, Artemis Beacon, Mini-Crate.  Ported some potion effects from old versions (butter, magnetism, frost walker, others).  New Potions: Gravity, Antigravity, Attack Range, Reach Distance.  Fixed Potion recipes not showing in Patchouli guidebook (cyclic:brewing page template).  Add missing enchantment pages to patchouli book. Refactored content registry to use forge Deferred registry (faster game loading times, and prep for 1.19.x port). A few new config options for some hardcoded numbers. Updated flippers item to use registered Attribute forge:swim_speed, which is a much smoother experience when swimming in all directions. Updated Step Height capabilities (enchant & apple) to use the registered Attribute 'forge:step_height_addition' instead of direct override on maxUpStep.  "
		,"1.7.4":"Ported from minecraft-1.10.2: Alluring Fishhook (cyclic:ender_torch).  Ported from minecraft-1.12.2: Throwing Torch (cyclic:ender_torch).  Added new potion effect cyclic:flight. Added: Bone Shield, Obsidian Shield.  Added item tag forge:shields.  The following blocks can now be disabled with redstone power (only run when not powered): Sound Muffler, Sound Recorder, Artemis Beacon.  "
		,"1.7.5":"Redstone clock can now be disabled with incoming redstone (has a Requires redstone button - feature ported from mc1.12.2).  Removed some log spam statements from 1.7.4"
		,"1.7.6":"Allow Home Command and others to Run in Functions #2138 . See examples in changelog"
		,"1.7.7":"Merge pull request #2157 from zhyupe/refactor/uncraft-recipe-matching . Fix Game crashing when teleporting or going through nether portal (UnbreakablePoweredBlock) #2142"
		,"1.7.8":"New feature: right-click the Crafting Stick anywhere in your inventory screen, even while not holding it, to open it. Fix 'unused frames [7]' error logs.  Added cyclic:milk_bottle to forge:milk item data tag (compatibility with FarmersDelight and other mods).  Fix #2171 Rich Soil acting translucent and blocksounds.  Reduce TerraGlass hardness to 0.5 from 1.8 Increase block hardness of Connected Glass to 0.3 matching Glass Block. Fix Combustion Generator consumes Empty Bucket #2146. Added Default Tinkers construct slime recipes to melter using forge conditionals (recipes by Darkosto).  Add #2167 JEED potion compatibility added https://www.curseforge.com/minecraft/mc-mods/just-enough-effect-descriptions-jeed .  "
		,"1.7.9:":"AutoCrafter overhaul: no longer gets stuck partway through crafting, no longer scans extra recipes.  Cables now respond better to wrenches: the yellow Blocked state only shows up while crouching, use a wrench while not crouching to toggle between normal->import->normal again."
		,"1.7.10":"Two blocks cyclic:peace_candle and cyclic:no_soliciting have large changes to prevent problems in large worlds or worlds with many mob spawns happening causing 'major issues where ticks would freeze in newly generated worlds' #2187, and causing memory stack traces (spark etc) to point out heavy load in 'BlockSpawnEvents.onLivingSpawnEvent()'. As a result players need to break and replace any existing instances of these two blocks before they start functioning (blocks each now have tile entity that refreshes a small cache when active; as a result each BlockSpawnEvents scans zero blocks in the world down from a 32x32x8 by default area or more instead checking the cache difference to spawn or not. as always you can set logging info=true in config for more debug spam in logs).  Some default configs updated and log warnings cleaned up.  "
		,"1.7.11":"Beekeeper enchant updated to use forges new LivingChangeTargetEvent (previous LivingSetAttackTargetEvent).  #2085 Hopper reach area & pickup logic now uses vanilla-hopper area size.  Port Fishing Net and Mending Fishingrods compatibility from 1.12.2 #2067. Ender Apple now sends a message if nothing is found (void/flatworlds/etc). Growth enchant attempts to use CropBlocks::growCrops() so custom crop mods can override behavior (defaults to normal).  Ported 15-ish new config file options from mc1.16.5 in the cyclic.toml file, see example here https://github.com/Lothrazar/Cyclic/blob/trunk/1.18/cyclic.toml .  For best results use forge 40.1.80+ and jei 9.7.1.255+ "
		,"1.7.12":"Fix Solar Generator #2154 #2155 .  Ore prospector item has new config prospector.height . Prospector now tells player the count of ores detected "
		,"1.7.13":"Fix #2159 laser beam rendering.  Fix #2152, and chorus flight is now compatible with flight potion. Add feature #1913 Wireless redstone transmitter can now attempt to reach across dimensions (example nether to overworld, only if chunk is already loaded by something else).  #2134 Add cyclic:gem_obsidian recipe that consumes Chorus Fruit, for consistency with 1.16.5 versions . Add inventory screen to Clay Battery and Solar Generator. Fix potion names.  Fix #2132 wither rose duplicate crusher recipes.  Add more default values to uncrafter ignore_list and ignore_recipe recipe ids (this means for newly generated default config files, the uncrafter will let you reverse dyes to other dyes but not dyes to flowers). Added 3 new to solidifier that use biomass fluid (moss_block, tallgrass).  "
		,"1.7.14":"Fix cyclic:auto_smelt enchant #2148 (NOTE: also check cyclic.toml and make sure enabled = true under auto_smelt header ). Fix Solar Generator #2154 #2155 .  Ore prospector item has new config prospector.height . Prospector now tells player the count of ores detected; Fix #2159 laser beam rendering.  Fix #2152, and chorus flight is now compatible with flight potion. Add feature #1913 Wireless redstone transmitter can now attempt to reach across dimensions (example nether to overworld, only if chunk is already loaded by something else).  #2134 Add cyclic:gem_obsidian recipe that consumes Chorus Fruit, for consistency with 1.16.5 versions . Add inventory screen to Clay Battery and Solar Generator. Fix potion names.  Fix #2132 wither rose duplicate crusher recipes.  Add more default values to uncrafter ignore_list and ignore_recipe recipe ids (this means for newly generated default config files, the uncrafter will let you reverse dyes to other dyes but not dyes to flowers). Added 3 new to solidifier that use biomass fluid (moss_block, tallgrass).  "
		,"1.7.15":"Life Leech no longer refills hunger (#2241).  Merged  Typo: double 'consume' (#2275)@Pifanjr.  Update Simplified Chinese Transaction (#2277)@UraraChiya.   "
		,"1.7.16":"Fix #2243 User output buffer (milk and other tranforming outputs from entity interactions). fix #2236 recipe conflict for moss block in solidifier_moss_block.json.  fix #2247 Charm Talisman Missing lava protection. Fix #2259: crates and other heavy blocks that keep their contents now drop motionless to avoid bouncing away for small base situations.  #2261 Smooth glass can be reverse-smelted back into plain glass.  Fix items that use RF not charging items on servers #2274 #2169. fix #2272 #2260 typos.  Fix #2268 material generator recipe. update candle models from #2182.  Fix  Smooth Glass looks incorrect underwater #2263. Fix  Tempered dark glass does not cull against itself #2262  "
	
	
	
	
	},
	"1.19.2": {
		"1.7.6":"First port to 1.19.  Most features ported except for a few that are coming later. (Worldgen for the 4 flowers is not implemented in this release)"
		,"1.7.7":"Fix keybinding menu crashing game #2140"
		,"1.7.8":"Game crashing when teleporting or going through nether portal (UnbreakablePoweredBlock)  #2142"
		,"1.7.9":"Merge pull request #2157 from zhyupe/refactor/uncraft-recipe-matching .  Remove debug logs "
		,"1.7.10":"Fix 1.19 fluid rendering.  New feature: right-click the Crafting Stick anywhere in your inventory screen, even while not holding it, to open it. Fix 'unused frames [7]' error logs.  Added cyclic:milk_bottle to forge:milk item data tag (compatibility with FarmersDelight and other mods).  Fix #2171 Rich Soil acting translucent and blocksounds.  Reduce TerraGlass hardness to 0.5 from 1.8 Increase block hardness of Connected Glass to 0.3 matching Glass Block. Fix Combustion Generator consumes Empty Bucket #2146. Added Default Tinkers construct slime recipes to melter using forge conditionals (recipes by Darkosto).  Add #2167 JEED potion compatibility added https://www.curseforge.com/minecraft/mc-mods/just-enough-effect-descriptions-jeed .  "
		,"1.7.11:":"AutoCrafter overhaul: no longer gets stuck partway through crafting, no longer scans extra recipes.  Cables now respond better to wrenches: the yellow Blocked state only shows up while crouching, use a wrench while not crouching to toggle between normal->import->normal again."
		,"1.7.12":"Two blocks cyclic:peace_candle and cyclic:no_soliciting have large changes to prevent problems in large worlds or worlds with many mob spawns happening causing 'major issues where ticks would freeze in newly generated worlds' #2187, and causing memory stack traces (spark etc) to point out heavy load in 'BlockSpawnEvents.onLivingSpawnEvent()'. As a result players need to break and replace any existing instances of these two blocks before they start functioning (blocks each now have tile entity that refreshes a small cache when active; as a result each BlockSpawnEvents scans zero blocks in the world down from a 32x32x8 by default area or more instead checking the cache difference to spawn or not. as always you can set logging info=true in config for more debug spam in logs).  Some default configs updated and log warnings cleaned up.  "
		,"1.7.13":"#2183 fix recipe conflicts with quark sturdy_stone.  Fix Ender Apple garbled output; replaced ignorelist with structure tag list for finding in this item.  Beekeeper enchant updated to use forges new LivingChangeTargetEvent (previous LivingSetAttackTargetEvent).  #2085 Hopper reach area & pickup logic now uses vanilla-hopper area size.  Port Fishing Net and Mending Fishingrods compatibility from 1.12.2 #2067. Ender Apple now sends a message if nothing is found (void/flatworlds/etc). Growth enchant attempts to use CropBlocks::growCrops() so custom crop mods can override behavior (defaults to normal).  Ported 15-ish new config file options from mc1.16.5 in the cyclic.toml file, see example here https://github.com/Lothrazar/Cyclic/blob/trunk/1.18/cyclic.toml .  For best results use forge 43.1.25+"
		,"1.7.14":"Fix cyclic:auto_smelt enchant #2148 (NOTE: also check cyclic.toml and make sure enabled = true under auto_smelt header ). Fix Solar Generator #2154 #2155 .  Ore prospector item has new config prospector.height . Prospector now tells player the count of ores detected; Fix #2159 laser beam rendering.  Fix #2152, and chorus flight is now compatible with flight potion. Add feature #1913 Wireless redstone transmitter can now attempt to reach across dimensions (example nether to overworld, only if chunk is already loaded by something else).  #2134 Add cyclic:gem_obsidian recipe that consumes Chorus Fruit, for consistency with 1.16.5 versions . Add inventory screen to Clay Battery and Solar Generator. Fix potion names.  Fix #2132 wither rose duplicate crusher recipes.  Add more default values to uncrafter ignore_list and ignore_recipe recipe ids (this means for newly generated default config files, the uncrafter will let you reverse dyes to other dyes but not dyes to flowers). Added 3 new to solidifier that use biomass fluid (moss_block, tallgrass).  "
		
		,"1.8.0":"Port away from forge @Deprecated api tags such as rendertype and old capabilities.  Life Leech no longer refills hunger (#2241).  Merged  Typo: double 'consume' (#2275)@Pifanjr.  Update Simplified Chinese Transaction (#2277)@UraraChiya.  Ported 1.18 feature to insert food into lunchboxes from inventory screen - pick up and right-click.   Fix #2243 User output buffer (milk and other tranforming outputs from entity interactions). fix #2236 recipe conflict for moss block in solidifier_moss_block.json.  fix #2247 Charm Talisman Missing lava protection. Fix #2259: crates and other heavy blocks that keep their contents now drop motionless to avoid bouncing away for small base situations.  #2261 Smooth glass can be reverse-smelted back into plain glass.  Fix items that use RF not charging items on servers #2274 #2169. fix #2272 #2260 typos.  Fix #2268 material generator recipe. update candle models from #2182.  Fix  Smooth Glass looks incorrect underwater #2263. Fix  Tempered dark glass does not cull against itself #2262  "

	
	,"1.8.1" :"Fix #2221 visual gui fluid bars. backport #2282 tags for tool types.  Fix multi-jump enchant #2256 and fix #2248 Cant open the Extended Inventory after eating the Ender Inventory Cake.  Fix 'Apple of lofty stature' not syncing when you rejoin the world, meaning the Step Height Disabled wasnt turning it off #2296 #2258. Exp boost no longer gives XP if the original harvest had a zero drop (stone/dirt etc) fix #2283.  Fix render_type of Melter and Solidifier. Melter and Solidifier now drain the 'rf per tick' from recipe constrantly, instead of one batch drain at the end (and fix bug #2284)"
	
	
	,"1.8.2":"(This update ports some features that had previously been exlusive to the mc 1.16.5-1.15.12 thru 1.16.5-1.15.21; all are listed below).  New configs: [cyclic.enchantment.disarm] now has 'ignoredMobs' and 'percentPerLevel', [cyclic.items.tile_transporter] now has 'overrideChestSingle', read on or see cyclic.yml for more details.  PR #1976 by metalshark :Item, Energy, and Fluid Cables now have Increased performance (compile time optimisations, reduction in cyclomatic complexity and removal of redundant checks).  PR #1994 by 'metalshark' Fixes issue #1992.   Merge pull request #2013 from metalshark : Add caching of packager recipes and move static methods out of main class for scaling.   Merge pull request #2011 from metalshark : Invalidate capabilities when declaring them.  #1933 Sack of Holding chest placement override added, with new config to revert back to legacy behavior if desired (overrideChestSingle).   #2168 fix bug where ender shelf sometimes would not save contents when mined after exiting reloading world when client data desyncs. Added a percentage config and ignorelist config for cyclic:disarm enchantment (disarmPercentPerLevel, disarmIngoredMobs), resolves it dropping your copied weapon from alexsmobs:mimicube #2249. Fix #1878 layered and/or logic for multiple wireless transmitters on the same node.  Now all git branches can be merged from mc-1.16.5 downstream to mc-1.20.1 and future updates as well. "
	

	},
	"1.19.3": {
		"1.9.0":"Ported to MC-1.19.3 (from 1.19.2-1.8.0)"
	
	},
	"1.19.4": {
		"1.10.0":"Ported to MC-1.19.4 (from 1.19.3-1.9.0)"
		,"1.10.1" :"Fix #2221 visual gui fluid bars. backport #2282 tags for tool types.  Fix multi-jump enchant #2256 and fix #2248 Cant open the Extended Inventory after eating the Ender Inventory Cake.  Fix 'Apple of lofty stature' not syncing when you rejoin the world, meaning the Step Height Disabled wasnt turning it off #2296 #2258. Exp boost no longer gives XP if the original harvest had a zero drop (stone/dirt etc) fix #2283.  Fix render_type of Melter and Solidifier. Melter and Solidifier now drain the 'rf per tick' from recipe constrantly, instead of one batch drain at the end (and fix bug #2284)"

	},
	"1.20.1": {
		"1.11.0":"Ported to MC-1.20 (from 1.19.4-1.10.0)",
		"1.12.0":"First official port to MC-1.20.1.  This mod now has a required dependency on flib(future-library 0.0.7 or greater).  Fixed worldgen flower features spawning with forge biome modifiers.  Fixed patchouli book.  added tools to minecraft tags (for example emerald_pickaxe in item tag minecraft:pickaxes).  Fix harvester crash with beetroot.  (Merge pull request #2286 from UraraChiya/trunk/1.20) : Update Simplified Chinese transaction. "
		,"1.12.1":"Fix transparency of several blocks (Terra Glass and both Clouds).  Fix blockrendering/transparency along edges of cyclic:lamp (waxed lamp).   Fix rendering of cyclic:laser_cannon beams #2295 and block highlights for Building Scepters and Location GPS.  Fix 'Apple of lofty stature' not syncing when you rejoin the world, meaning the Step Height Disabled wasnt turning it off #2296 #2258. Exp boost no longer gives XP if the original harvest had a zero drop (stone/dirt etc) fix #2283.  Fix render_type of Melter and Solidifier. Melter and Solidifier now drain the 'rf per tick' from recipe constrantly, instead of one batch drain at the end (and fix bug #2284)  "
		,"1.20.2":"For ease of use and better visuals, and to better match modern rendering pipelines, the Shape Data card, Building Scepters and the Block Randomizer now uses a block-outline wireframe method to hilight blocks instead of rendering cube-faces (for example, the GPS data card still uses the cube-faces render and not wireframe).  (This update ports some features that had previously been exlusive to the mc 1.16.5-1.15.12 thru 1.16.5-1.15.21; all are listed below).  New configs: [cyclic.enchantment.disarm] now has 'ignoredMobs' and 'percentPerLevel', [cyclic.items.tile_transporter] now has 'overrideChestSingle', read on or see cyclic.yml for more details.  PR #1976 by metalshark :Item, Energy, and Fluid Cables now have Increased performance (compile time optimisations, reduction in cyclomatic complexity and removal of redundant checks).  PR #1994 by 'metalshark' Fixes issue #1992.   Merge pull request #2013 from metalshark : Add caching of packager recipes and move static methods out of main class for scaling.   Merge pull request #2011 from metalshark : Invalidate capabilities when declaring them.  #1933 Sack of Holding chest placement override added, with new config to revert back to legacy behavior if desired (overrideChestSingle).   #2168 fix bug where ender shelf sometimes would not save contents when mined after exiting reloading world when client data desyncs. Added a percentage config and ignorelist config for cyclic:disarm enchantment (disarmPercentPerLevel, disarmIngoredMobs), resolves it dropping your copied weapon from alexsmobs:mimicube #2249. Fix #1878 layered and/or logic for multiple wireless transmitters on the same node.  Now all git branches can be merged from mc-1.16.5 downstream to mc-1.20.1 and future updates as well."
 		,"1.20.3":"Requires flib-0.0.10.  Fix preview rendering #2317.  Machines now have an alternate render preview option.  Recipe balance changes applied (only mc 1.20.1+).  Fix #2297 shield textures.  "
		,"1.20.4": ""
	}
}
