{
  "homepage": "http://minecraft.curseforge.com/projects/cyclic",
  "promos": {
    "1.15.2-latest": "0.5.0",
    "1.15.2-recommended": "0.4.2"
  },
  "1.15.2": {
  	"0.1.8":"Fixed server crash"
  	,"0.1.9":"Fixed charms not activating.  Fixed auto torch crash.  Magnet enchant now does not trigger in spectator.  Fixed error in Excavate enchant.  Ported Launch enchant"
  	,"0.1.10":"Fix main menu crash"
  	,"0.1.11":"Sleeping mat item ported.  Spawner Seeker item ported.  Fix log spam.  Fix Remote Lever message text.  Sack of holding now checks player-relative block hardness for compatibility (zero or less it will not pick up).  "
  	,"0.2.0":"Step Height enchantment added only for leggings.  Block Reach enchant ported.  Minimum forge_version 31.1.25.  Fluid tank rendering rebuilt, fixed blockstates and autodrain.  zh_cn.lang updated by sandtechnology.  Fixed game crash with Emerald Carrot, item now works as expected.  Fixed some language file issues.  Fixed Torch Launcher velocity and distance back up to 1.12 speeds.  Fixed Auto Torch going into negative durability.  Fixed boomerange dupe. "
  	,"0.3.0":"Added powered anvil, three building items, block randomizer, Anti-gravity ring.  Many items now correctly consume durability and play sounds"
  	,"0.3.1":"Added item pipes, added fluid pipes, New item Cable wrench, added structure builder, Changed some other things, this is an alpha build for testing but its pretty stable."
  	,"0.3.2":"Fixed fire charm particles crashing serverside.  Fixed harvester not producing netherwart.  Fixed handheld item rendering.  Torch launcher is immensely less likely to place in invalid spots.  Experience pylon gives more information when using it, and now works with empty bottles. When Ender Eye Reuse is used, the entity will Always shatter and never drop an item.  Experience pylon now has much higher capacity. "
  	,"0.3.3":"Config added to disable cables.  Fixed Peat Bog conversion chance, and put it in a config value.  Excavation enchant improved: now compatible with NBT based blocks such as shulkers to not delete contents; uses forge ForgeHooks.canHarvestBlock on every block for compatibility with all sorts of thing; drop experience orbs such as from ores while harvesting.   Fixed scythes.  Fix a server crash when picking a block with one of the building scepters.  Add tool_mode sound back in for changing modes. Fixed some blocks not dropping their inventory contents on break.  "
  	,"0.3.4":"Fixed harvester crashing when modded crop drops no seeds"
  	,"0.4.0":"Added 5 liquids (biomass, honey, magma, slime, experience).  Improved Battery GUI.  Added enriched peat.  Added machines Melter and Crystallizer, each with recipes.  Added 4 magic tools.  Some recipes changed.  Added hearts.  Added Config file updates.  "
  	,"0.4.1":"Auto torch blocked in spectator mode.  New enchantment growth for Hoe tools.  Crystalizer fix.  Hearts system uses attributes now to be more compatible.  Hearts now save through death.  Traveller enchantment added (protects against elytra and ender pearl damage).  Cables will no longer deposit into a direction with an 'Extraction Mode' setting, it is treated as one-way.  "
 	,"0.4.2":"Fixed energy GUI bars showing negative values (usually only bugs out on servers).  Enchantments no longer trigger effects when only on an enchanted book.  Fixed torch launcher overwriting and replacing some semi-solid blocks such as chests.  Harvester now gathers melon, pumpkin, sugar cane, cactus, bamboo, and vines (using block data tag cyclic:harvester_break, modpacks can add more).  Heart containers compatibility fix. "
  	,"0.5.0":"Experience Pylon is now collects fluid and has a GUI. "
  }
}
