{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/cyclic",
  "promos": {
    "1.16.4-latest": "1.0.0",
    "1.16.4-recommended": "1.0.0"
  },
  "1.16.4": {
    "0.6.1":"Ported "
    ,"0.6.2":"Fixed crash in harvester GUI.  Remove logspam in Disenchanter.  Patch StackOverflowError in Excavate enchant when level is high.  Fixed projectiles thrown from items not flying.   Fan now can blow through non-solid blocks.  Fan has a GUI to control speed and range.  Beheading mob heads config list added.  Beheading enchant is able to drops skulls from wither boss equal to its level.  Fixed some resource and file not found warnings in startup console.   "
    ,"0.7.0":"Fixed 'lost connection: Took too long to log in' on servers.  Water scepter thing works on water-logged blocks.  Upgraded GUI of several blocks.  Ported from 1.12: Pharos Beacon, Creative battery, Creative item tester, Dice, Dropper, Forester, Miner, Text Projector, Uncrafter.  New blocks: Terra Preta, Mason blocks.  "
    ,"0.7.1":"All Solidifier and Melter recipes are now defined as JSON files and new recipes can be added by pack developers using the JSON format. "
    ,"0.8.0":"Flippers item added.  Items that can be turned off now have an on-off tooltip for the right-click toggle feature (currently just flippers and glove).  Haste potion added.  Fixed Powered anvil eating items.  Added config to disable power consumption; set requirement to zero for the machine.  ( vemerion ) Fix a bug where stun and swimspeed potions were brewable from any potion. ( trunksbomb: all of the following ) Fix compatibility issue with added hearts.  Correct bug with thrown direction of monster ball, add particles . Fix Harvester to harvest the correct area.    Missing hardness property causing the block to break instantly;   Missing loot table causing the block to not drop itself;   Null pointer crash when accessing the GUI due to POWERCONF not being set in Config;   Crash when placing the Collector while facing UP or DOWN (only horizontal facings are allowed).  Store UUID of User (the tile entity, not the player) in NBT . Restore missing functionality to Experience Pylon such as item interactions. "
    ,"0.8.1":"Fixed foreseter crash; it now uses data tag minecraft:saplings to identify what is plantable.  ( trunksbomb ) Patchouli guidebook added.  New enchantments: Gloom, Auto Smelt, Disarming.  Battery now renders on the side how much power is stored.  Ported from 1.12: Rod of elevation; Peat Farmer; Water Candle; Vision Helmet.  Many items can now be used in midair, clicking a block not required (heart items, wings). "
    ,"0.8.2":"Trash Void now accepts fluids as it did in 1.12.  Fixed bug where Miner could get stuck on non-mineable block, or on liquid, also it sometimes would skip valid blocks.  Fluid collector now correctly pays energy cost when processing.  Fixed bug in forester where it wasnt mining the bottom log of the tree.  Fixed an issue where player would fall through Scaffolding blocks and sit inside them, they are correctly solid now.  ( trunksbomb ) New Ender enchantment for swords: what used to be block now spawns an ender pearl. "
    ,"0.8.3":"Auto-Smelting enchantment can now be applied to other mining tools such as Axes.  Updated pachoulli guidebook with more entries.  Emerald tools now use sticks instead of diamonds.  Used player->floatingTickCount to prevent player from being 'kicked for flying' when using climbing and levitating objects such as Fan, Air charm, etc.  Cyan Rose now spawns in the following biome-types: FOREST, PLAINS, TAIGA, EXTREME_HILLS.  Improved the mod logger to remove log-spam; added a config to unblock that is off by default.  ( trunksbomb ) Added Fireplace block.  Added Crafting Machine.  Added Ender Scepter.  Added Caving Torch Charm."
    ,"0.9.0":"Removed the config toggles that un-register items, this is not supported by mojang or forge it simply throws MissingMappings crash exceptions (to remove content, delete recipes in a data pack and hide from JEI).  Terra Preta no longer works on blocks that are immune to bonemeal (if they have canUseBonemeal() -> false).  Shape builder update: optional shape slot and GPS slot, the GPS slot will change the center of the target build, default is still the machine; the shape slot will READ in the current shape while the machine is running (break and replace existing machines).  New Shape computer added to write builds in the world onto data cards.Shape data card can build structures in the world relative to the player Harvest Scythe added.  Ender enchantment updated so it will not shoot the pearl if you successfully open a chest.  Added settings data card item. Renamed GPS Marker to GPS Data Card.  Added ender carrot.   Added chocolate, honey, and metal apples.   Added more default honey recipes.  Fixed fan transparency bug.  Fan GUI updated.  Fixed bug where Peat generator was eating items when full.  Beekeeper enchant added.  ( trunksbomb ) Fixed Experience Enchant triggers when enchanted item is held in the offhand and blocks are broken with the mainhand. "
    ,"0.9.1":"Hotfix for server crash"
    ,"0.9.2":"Fixed Empty Heart Container error.  Fixed Text Projector not working on servers.  Fixed the buttons in Item Collector not showing their status.  Fixed crash caused by death; related to experience boost enchant ( thanks henkelmax ) "
    ,"0.9.3":"Fix Item collector rendered region not matching pickup area.  More recipes use data tags instead of items (example: forge:leather, forge:string, forge:slimeballs). Updated some internal power transfer logic to avoid client-server desync.  Fix Disenchanter energy cost.  Fixed automated Users syncing/consuming items such as buckets.  Slight power buff to Excavation enchant.  ( trunksbomb ) Fix client desync of applied potion effect on Gloom.  Fix crash when releasing mobs with NBT data from Monster Ball.   Fix server crash due to recursion from Excavation Enchant activating, and check harvestlevel of each blockstate.  Add ability to extract honeycomb from hives and nests to Cyclic-added shears  "
    ,"0.9.4":"Added config options to disable any enchantment.  Cyan flower worldgen feature is now registered in the Feature registry (mod compatibility).  Fixed bug where players cannot input 'e' in the text projector.  Harvester now works with crops from the Resynth mod.  Fixed Excavate enchant not working on redstone ore.  Add User power config option.  Added workaround to force User to work with some Mystical Agriculture tools.  ( trunksbomb ) Fix Issue #1604, Forester only tried to harvest blocks if its inventory was empty.  Fix Harvester breaking stems for pumpkins, melons, etc. Fix Monster Ball not waking up sleeping entity. "
    ,"0.10.0":"Laser Cell port from 1.12.  Improved bounding-boxes of some blocks. Spikes block now have their baseplate take up the full block instead of being a bit too small to fill the full blockspace.  Fixed emerald carrot not affecting horses jump height.  Fishing Net has a GUI added by request.  ( trunksbomb ) New unbreakable bedrock with custom texture, control with redstone.  Magnet enchant is now compatible with Botania 'solegnolia'.  Solid Ender Eye now works with the customized strongholds from 'Repurposed Structures' mod.  Fixed compatibility with inventory-sorting mods such as Inventory Tweaks. ( BugmanBugman ) Capitalize the names of some items in en_us lang"
    ,"0.10.1":"Added Crafting Stick and Advanced Crafting Stick.  ( trunksbomb ) Ported Storage Bag.  Ported Ender Shelf and Ender Shelf Controller.  "
  	,"1.0.0":"Added Ghost Block and Phantom Block.  Fixed the JEI '+' button compatibility with Solidifier recipes.  Experience Pylon: When sneaking on top to deposit XP into the pylon, it pulls MUCH faster when your level is higher, and slower at lower levels; and it ignores the on/off state, and fix button getting stuck.  Fixed Magma anvil not functioning/repairing.  Fixed game crash in Terra Preta block.  Items/charms that teleport the player now respect the EnderTeleportEvent cancellation logic.  Harvester optimized to run more slowly, (run 1 time every 10 ticks, instead of 16 times in a single tick).  Added Ender Trigger and Ender Anchor.  The Sack of Holding (cyclic:tile_transporter) bag now has a config list of blocks to disable pickup (Spawners are defaulted in this list).  Config file entries added for Uncrafter: ignore list, NBT flag, timer.  Crafting Sticks have dartcraft-stype buttons to empty and balance the grid.  Add power consumption of cyclic:structure block to config.  Fix beheadingEntityMHF config loading.   ( trunksbomb )  Ported Workbench. Ported  Antimatter Evaporator."
    ,"1.0.1":"Excavation harvest level logic fixed not being able to excavate many combinations (such as Terracotta with pickaxe), relies now on ForgeHooks.canHarvestBlock.  ( trunksbomb ) Fix server crashes for Storage Bag and Workbench. "
  }
}
