{
  "homepage": "http://minecraft.curseforge.com/projects/cyclic",
  "promos": {
    "1.9.4-latest":  "1.2.0",
    "1.9.4-recommended":  "1.2.0",
    "1.10-latest":  "1.1.0",
    "1.10-recommended": "1.1.0",
    "1.10.2-latest":  "1.5.2",
    "1.10.2-recommended": "1.5.2"
  },
  "1.9.4":{
  	"1.0.0":"Launch " 	
  	,"1.1.0":"Add new Magic Bean plant, gives semi-random item on harvest.  Fix issue #33 crash) and #35 (garden scythe invalid harvest) from issue tracker"
  	,"1.2.0":"Add new Conveyor Belt item.  Fix broken magic bean recipe.  The Launch enchant can now go up to level V (5).  Slime launch pads now with with non living entities (such as items). "
 },
  "1.10":{
  	"1.0.0":"Launch "
  	,"1.0.1":"Garden Scythe now works with netherwart.   Uncrafting Grinder fix sync issues.  Inventory tabs not saving on reload fixed.  Add custom sound to heart container"
  	,"1.0.2":"Add config to disable inventory shift keybinds.  Remove redundant endermen spawning feature (its in vanilla 1.10 now).  "
  	,"1.1.0":"Add new Magic Bean plant, gives semi-random item on harvest.  Fix issue #33 crash) and #35 (garden scythe invalid harvest) from issue tracker"
  },
  "1.10.2":{
  	"1.0.0":"Launch " 	
  	,"1.1.0":"Add new Magic Bean plant, gives semi-random item on harvest.  Fix issue #33 crash) and #35 (garden scythe invalid harvest) from issue tracker"
  	,"1.2.0":"Add new Conveyor Belt item.  Fix broken magic bean recipe.  The Launch enchant can now go up to level V (5).  Slime launch pads now with with non living entities (such as items). "
  	,"1.3.0":"Add Life Leech weapon enchant.  Stack sizes: blow out config to toggle each item off on its own & add ender pearl.  Fix Ender Aura potion not triggering at all (it prevents thrown pearl damage). Fix potion textures showing on top of F3 screen. Fix deposit button un-equipping your boots. Fix heart containers not syncing when changing dimensions."
  	,"1.3.1":"Fix slime plates crashing the game when hit by exp orb"
  	,"1.3.2":"Optimize Biome Crops feature reducing its memory footprint (This caused lag and memory leak on generating new worlds / chunks).  Fix text for /villageinfo command."
  	,"1.3.4":"Fix the 'fast stardew furnace' feature glitches where items would vanish or spew in wrong direction.  Add biome to /ping, and allow calling from non-players.  Hide 'within spawn' and 'from spawn' F3 info if you are in another dimension.  Searchitem command: work with all inventories (even modded) and show distance away. "
  	,"1.3.5":"Inventory upgrade buttons no longer cover the helmet slot, and hide when it makes sense to.  Add keybinding to open extended inventory if unlocked (by request).  Nerf magic beans recipe and harvest output.  Storage bag now only needs gold not diamond.  New recipe: melon block to slices. Garden scythe now harvests reeds and cactus.  "
  	,"1.4.0":"Add Snow Potion.  Add Spawn Detector to detect mob spawns, including wither skeletons and light levels.  New mob feature: skeletons and zombies mutate when hit by lightning.  Mod items can spawn in loot chests.  Add loot tables to mobs that dont have much (enderimtes, shulkers, etc - see in game config).  Fix a reported Uncrafting Grinder bug.  "
 	,"1.4.1":"Fixed two crash bugs: with Cyclic Scepter and with Scaffolding blocks. "
  	,"1.4.2":"Fix for the spawners hardness. " 	
  	,"1.4.3":"Fix chest sack glitching out and deleting items. "
  	,"1.4.4":"Add config category 'content' to remove items and blocks added.  Fix Mounted Pearl feature not keeping the horse attached to you"
	,"1.4.5":"Hot fix not loading on servers (#61).  Hotfix Exp Achievements misfiring on false positives (#60). "
 	,"1.5.0":"New block: Harvester.  New block: Item Magnet.  Added a config option to disable potion effects from Sleeing Mat.  Fix Garden Scythe leaving a floating block (#64).  Magnet enchant now only goes to I not V (levels barely had a difference anyway)"
 	,"1.5.1":"Fix Garden Scythe rotating cocoa beans on harvesting (#67)"
 	,"1.5.2":"Mod compatibility fixes"
 }
}