{
  "homepage": "http://minecraft.curseforge.com/projects/cyclic",
  "promos": {
    "1.9.4-latest":  "1.2.0",
    "1.9.4-recommended":  "1.2.0",
    "1.10-latest":  "1.1.0",
    "1.10-recommended": "1.1.0",
    "1.10.2-latest":  "1.10.30",
    "1.10.2-recommended": "1.10.30",
    "1.11.2-latest": "1.5.11",
    "1.11.2-recommended": "1.5.11",
    "1.12-latest": "1.8.6",
    "1.12-recommended": "1.8.6",
    "1.12.2-latest": "1.15.0",
    "1.12.2-recommended": "1.14.9"
  },
  "1.9.4":{
  	"1.0.0":"Launch " 	
  	,"1.1.0":"Add new Magic Bean plant, gives semi-random item on harvest.  Fix issue #33 crash) and #35 (garden scythe invalid harvest) from issue tracker"
  	,"1.2.0":"Add new Conveyor Belt item.  Fix broken magic bean recipe.  The Launch enchant can now go up to level V (5).  Slime launch pads now with with non living entities (such as items). "
 },
  "1.10":{
  	"1.0.0":"Launch "
  	,"1.0.1":"Garden Scythe now works with netherwart.   Uncrafting Grinder fix sync issues.  Inventory tabs not saving on reload fixed.  Add custom sound to heart container"
  	,"1.0.2":"Add config to disable inventory shift keybinds.  Remove redundant endermen spawning feature (its in vanilla 1.10 now).  "
  	,"1.1.0":"Add new Magic Bean plant, gives semi-random item on harvest.  Fix issue #33 crash) and #35 (garden scythe invalid harvest) from issue tracker"
  },
  "1.10.2":{
  	"1.0.0":"Launch " 	
  	,"1.1.0":"Add new Magic Bean plant, gives semi-random item on harvest.  Fix issue #33 crash) and #35 (garden scythe invalid harvest) from issue tracker"
  	,"1.2.0":"Add new Conveyor Belt item.  Fix broken magic bean recipe.  The Launch enchant can now go up to level V (5).  Slime launch pads now with with non living entities (such as items). "
  	,"1.3.0":"Add Life Leech weapon enchant.  Stack sizes: blow out config to toggle each item off on its own & add ender pearl.  Fix Ender Aura potion not triggering at all (it prevents thrown pearl damage). Fix potion textures showing on top of F3 screen. Fix deposit button un-equipping your boots. Fix heart containers not syncing when changing dimensions."
  	,"1.3.1":"Fix slime plates crashing the game when hit by exp orb"
  	,"1.3.2":"Optimize Biome Crops feature reducing its memory footprint (This caused lag and memory leak on generating new worlds / chunks).  Fix text for /villageinfo command."
  	,"1.3.4":"Fix the 'fast stardew furnace' feature glitches where items would vanish or spew in wrong direction.  Add biome to /ping, and allow calling from non-players.  Hide 'within spawn' and 'from spawn' F3 info if you are in another dimension.  Searchitem command: work with all inventories (even modded) and show distance away. "
  	,"1.3.5":"Inventory upgrade buttons no longer cover the helmet slot, and hide when it makes sense to.  Add keybinding to open extended inventory if unlocked (by request).  Nerf magic beans recipe and harvest output.  Storage bag now only needs gold not diamond.  New recipe: melon block to slices. Garden scythe now harvests reeds and cactus.  "
  	,"1.4.0":"Add Snow Potion.  Add Spawn Detector to detect mob spawns, including wither skeletons and light levels.  New mob feature: skeletons and zombies mutate when hit by lightning.  Mod items can spawn in loot chests.  Add loot tables to mobs that dont have much (enderimtes, shulkers, etc - see in game config).  Fix a reported Uncrafting Grinder bug.  "
 	,"1.4.1":"Fixed two crash bugs: with Cyclic Scepter and with Scaffolding blocks. "
  	,"1.4.2":"Fix for the spawners hardness. " 	
  	,"1.4.3":"Fix chest sack glitching out and deleting items. "
	 ,"1.4.4":"Add config category 'content' to remove items and blocks added.  Fix Mounted Pearl feature not keeping the horse attached to you"
	,"1.4.5":"Hot fix not loading on servers (#61).  Hotfix Exp Achievements misfiring on false positives (#60). "
 	,"1.5.0":"New block: Harvester.  New block: Item Magnet.  Added a config option to disable potion effects from Sleeing Mat.  Fix Garden Scythe leaving a floating block (#64).  Magnet enchant now only goes to I not V (levels barely had a difference anyway)"
 	,"1.5.1":"Fix Garden Scythe rotating cocoa beans on harvesting (#67)"
 	,"1.5.2":"Mod compatibility fixes"
 	,"1.5.3":"A few recipes no longer require beacons & nether stars.  Add world config to disable all loot chest insertions.  "
 	,"1.6.0":"Added Password Trigger, Miner, Miner Advanced, Placer, Cavefinder and Prospector.  Harvester recipe is now cheaper.  Added several item and block properties to config.  All machines (uncrafter, etc) activate on any redstone power, not just strong power.  Removed feature events to restrict sapling growth and give EXP for achievements (they never worked perfectly anyway).  "
 	,"1.6.1":"Fix uncrafting grinder shooting backwards.  Fix Piston wand block updates not syncing to clients when playing on a server.  "
	,"1.6.2":"Structure Builder moves faster when skipping over blocked areas.  Tooltips added to many items.  Reset button added to cyclic wand gui.  Builder and Placer machines now don't let in items that aren't placeable as blocks.  Machines now let hoppers pull contents from below.  Tweak costs of a few recipes.  Add long 8:00 version of snow potion.  "
	,"1.6.3":"New Controlled Miner added; it auto mines a 9x9 area, control the height, tool used, and blacklist.  Harvester range added to config, and increased default to 16.  Block Miner Advanced now starts at the level of the block instead of one below.  "
  	,"1.6.4":"Fix Item Magnet not pulling up off farmland to the hopper, and fix it not pulling items when they are 1 block away."
  	,"1.7.0":"New Content: Automatic Fishing Net, Ender Wing, Ender Wing Prime, Fire Charm, Sailor Charm, Void Charm, Water Charm, Sandstone Tools.  Add reverse recipes for quartz block and snow block.  "
  	,"1.7.1":"Make sure broken tools get cleared from Auto Fisher and Controlled Harvester.  Fix text output from /villageinfo command.  Ender Bombs: different texture for each level, and more recipe options.  "
  	,"1.7.2":"Fix fatal crash in Structure Builder.  Fix equip animation on storage sack.  "
  	,"1.7.3":"Fix launch enchant firing while swimming.  Add Raw fish trade to druid villager.  Add glowstone reverse recipe.  "
  	,"1.7.4":"Fix tool and armor repair material not set correctly.  Caused crashes and incompatibility with botania and possibly other mods."
  	,"1.7.5":"New Feature: use an armor stand while sneaking to swap your entire armor set (ArmorStandSwap in config).  Tree scythe now works with more leaves from other mods - rubber ic2, biomes o plenty, and more.  Added some config file defaults for mod compatibility with tinkers construct guis.  If Altered Stone config is turned on, tools are crafted with only smoothstone, not variants.  Add recipe to reverse netherwart block.  Sound of launch enchant is less overpowering.  Uncrafting grinder speed is now in config file (cyclicmagic.cfg).  Ocean generator details in config.  New InventoryUpgradeKeepOnDeath config option to change if the extended inventory items drop on death.  Tweak dungeon finder flightpath: slower initially, flies more horizontal when far away, then goes vertical later on.  "
 	,"1.7.6":"New items: Wing Charm, Block Randomizer, Automatic Torch, Exchange Scepters.  Fix a game crash if certain potions were disabled by config.  Fix Sack of Holding not compatible with tile entities from some mods (such as EnderIO Buffers).  Fix Bucket Storage block dropping items when broken in creative.  Fix tools being held the wrong way, they now render like swords instead of items when in hand (also some textures got flipped). "	
  	,"1.7.7":"Addressed a crash with the new Exchange scepters on falling blocks like gravel.  Fix visual glitches with new tools affecting the food/armor bar graphics.  Added missing recipe for Block Randomizer.  A few compatibility tweaks for Tinkers Construct (for gui issues, in bottom of config file you may have to reset 'Blacklist Container CSV' to default if there are any issues)."
 	,"1.7.8":"Fix storage sack crashing the game when you use number hotkeys to put it inside itself.  Fix typo in a config description.  Fix spammy messages in fml-client-latest.log.  "
  	,"1.7.9":"Fix the Block Placer crashing on trying to play a sound.  Fix bag of holding not copying block metadata - such as copper chests from ironchests mod."
  	,"1.7.10":"Re-designed the inventory crafting screen (unlock by eating Inventory Crafting item).  It mirrors player inventory more closely with armor slots; has its own keybinding to open it; is now compatible with FTB Utilities; and has full JEI support.  Fixed the Druid villager missing texture (was using the vanilla green villager)"
  	,"1.7.12":"Fix block miners crashing when used in multiplayer on sponge servers (attempting mod compatibility with spongeforge-1.10.2-2092-5.0.0-BETA-1770).  Fix rare exceptions from exchange scepters (ConcurrentModification)."
  	,"1.7.13":"Charms have new recipes, they no longer break on empty durability, instead they are repairable.  Charms and have optional Baubles API support.  New items: Speed Charm, Ender Orb Translocator.  Fix Jump plates to show accurate number of blocks in tooltip.  Spawners Unbreakable now defaults to false in config.  Rebalanced how mod items are distributed in loot tables (some cheaper less valuable items removed such as ender torch, other odds rebalanced).  Fix some items not consumed when thrown using offhand (ender bomb and others).  Added achievement page.  Fix some typos and conflicts in some of the commands useage info and aliases.  Fix scaffolding not dropping as an item when breaking, and increase recipe output slightly."
	,"1.7.14":"Fix Sack of Holding leaving behind ghost blocks or invisible chests when used to pick up half of a double chest.  Sack of holding now always drops the full sack on the player going both ways (instead of sometimes where the chest was, and sometimes where the player is).  Add error handing to Ender Shears to avoid ticking entity crashes, and make sure Ender Shears drops as an item when it hits a block, or a sheep that has already been sheared, or any non-sheep entity.  "
  	,"1.7.15":"Compatibility: fix Magic Bean not getting harvested by Pams Harvestcraft right-click auto-harvest feature.  Make sure Magic Bean always drops its seed when broken, fully grown or not.  Magic bean now respects drops two random items by default if broken, and respects fortune on tools.  Add a bit Magic Bean loot such as stained glass and hardened clay, a few other things (this helps dilute the really good stuff ... it still currently drops vanilla items only)."
  	,"1.7.16":"Fix potion upgrade recipes not working (ingredients changed to changed to gold & ink sacs instead of redstone/glowstone as workaround for known& reported bug in forge).  Added Hit Deposit mode to storage sack: Hit on a block to change modes, and hit on a container to deposit (if you have enabled it).  Add smelting recipes for End & Nether ores by request in case you silk touch them.  Removed key modifiers from default keybindings, (since in current forge version, the modifier cannot be removed: if you rebind to a single key, and restart,  the modifier from the default gets put back on your new key).  Fix keybindings for Extended Inventory and Inventory Crafting not closing the screens when open.  Add chat message to ender dungeon finder if no spawners are in range.  Fix Ender Book crashing servers when players used it and didn't have enough experience points."
  	,"1.7.17":"Machines with inventory now output comparator signals based on contents just like chests (affects Uncrafting Grinder, Controlled Miner, Block Placer, Structure Builder)"
  	,"1.7.18":"Fix helper buttons crashing when trying to deposit on invalid containers (such as Password Trigger).  Fix duplication bug with some some blocks (such as Quantum Storage Unit) when using Sack of Holding.  "
  	,"1.7.19":"Fix duplication bug on Storage Sack with Quantum Storage blocks again (update to build 1.7.18)"
  	,"1.7.20":"Fix Stack of Storage displaying the Items Deposited: message even when no items were moved.  Make sure identical item stacks get merged if possible when using Dump mode.  Fix Password Trigger block so it is not instamane (has hardness) and is harvestable by a pickaxe.  Ender Torch recipe now produces 32, up from 8.  "
  	,"1.7.21":"New Machine: Automated User (automated item use / right click).  Tweak tooltips on a few other machines.  "
 	,"1.7.22":"Fix Auto Fisher sometimes crashing when unloading chunks (and getting a null loot table).  Avoid ConcurrentModificationException crashes when using exchange scepters or the piston wand (now uses minecraft's vanilla built in addScheduledTask to avoid modifying server data asynchronously).  Also for these scepters increase cooldown from 8 ticks to 10.  Sack of holding now works with more stuff (for example, the machines from Extra Utilities 2).  Change default value of TerrariaInventoryButtons to false (it has caused issues with several other mods now.  Can still be re-enabled client side) "
 	,"1.8.0":"Uncrafting Grinder: Config blacklists moved from blocks category to modpacks (so no longer visible with ingame config gui);  blacklists now correctly use the modid:itemname string for vanilla and modded items; You can now blacklist an entire modid from the uncrafter.  Also no longer uncrafts enchanted items, or unenchanted items using a recipe that creates an enchanted one (Fixes the progressive automation/nether star exploit);  recipe slightly changed, 3 obsidian instead of 1;  Harvester: processing time now in config file.  Nether and End ores now have correct mining levels set (so no longer can you mine nether diamond ore with a wooden pickaxe for example).  Auto fisher now respects mending enchantment to repair fishing rods with fished exp (it already worked with luck and unbreaking and others before).  Autofisher now runs every second instead of every tick (default speed is still the same at 7% chance to catch).  Autofisher speed in config file."
  	,"1.8.1":"Fix Uncrafting Grinder BlacklistOutput not working.  Fix Cyclic machines losing their data (items, etc) when their block state gets changed (when they get rotated by some modded item).  Fix Prospector tool not detected modded ores: It now lists out every block found and its count, not just ores."
 	,"1.8.2":"Both Harvester and Garden Scythe now consume one seed from the block drops while replanting.  Cyclic Scepter: add config toggle to turn off the purple particle beam on use.  Fix Cyclic Scepter claiming to be empty and not building when actually only the first two slots were empty and others had blocks.  Redstone carrots now increase horse speed by 1% each, down from 5%.  Ender carrots now increase horse jump height by 1% each, down from 2%.  Magic Bean now grows with bonemeal.  Add config option in items category for saddles horse armor, and records to stack to 16.  "
  	,"1.8.3":"Harvester and Block Miner now have a GUI screen.  All cyclic machines that required redstone now have a redstone toggle button in their GUI: This allows you to change between two modes: Always On and Requires redstone.  Increased mining efficiency of Block Miner.  Removed the recently added stacksize 16 for records: Vanilla jukeboxes are buggy and can't handle this, causes item duplication."
  	,"1.8.4":"Fix Auto Fisher sometimes crashing when the fishing rod is empty or does not have mending.  "
  	,"1.8.5":"Harvester GUI now has two new buttons: You can change the harvest area as well as preview it.  The Harvester size is no longer in the config file.  All machine block models face the same direction in your inventory now.  New Item: Stirrups.  Add missing config for existing feature: 'F3SpawnChunkInfo' for Within Spawn or Distance from spawn chunk text on F3 menu.  Add missing config for existing feature 'F3HorseInfo'.  Fix Sack of Storage merging items with different NBT data.  Added zh_CN.lang.  Rebalanced some early game trades on Sage and Druid villagers, and added new trades at the end (new spawns not existing). "
  	,"1.8.6":"Fix Tree Scythe and Brush Scythe not working.  Fix Magic Bean not dropping its seed when at full growth.  Increased recipe output of many of the Ender projectiles.  "
  	,"1.8.7":"Added shearing block.  Added torch launcher.  Cyclic Building Scepter given a more descriptive name.   Some tool recipes changed to use quartz instead of ghast tears: Piston Scepter, Cyclic Building Scepter.  Fix Structure Builder placing leaves that decay right away.  Structure Builder and Cyclic Build Scepter now play the block place sounds as they build.  Fix Auto Torch attempting to place in liquids.  Tweaked & cleaned up a few item textures.  New Recipe and JSON Models for the Randomizer and the Exchange Scepters."
  	,"1.8.8":"Fix Uncrafting grinder bug when trying to insert into Refined Storage Interface block.  Fix Uncrafting Grinder sometimes merging items with different NBT data.  ProspectorRange now has default config value of 32 instead of 16 (doesn't affect existing config files).  Stop the thrown torches (from Ender Torch or Torch Launcher) land on non-solid surfaces (such as on leaves or flowers).  Add missing sound effect to torch launcher.  "
  	,"1.8.9":"Fix compatibility with commands and HelperFixer (compareTo issues from server logs & possible crashes running /help).  Horse upgrade carrots for speed and jump now increase at a constant rate and not a percentage; this also fix incorrect upgrading while the horse is under jump or speed potions.  "
 	,"1.8.10":"Fix the Cyclic scepter crashing the client when trying to place a block on empty space at max range and failing to play a sound effect"
  	,"1.8.11":"New Item: Ender Sack.  New Block: Interdiction Plate.  "
  	,"1.8.12":"Uncrafting Grinder GUI overhaul: New help button to identify if an item can be uncrafted, and if not it gives a reason.  It no longer tries to deposit items into containers (was incompatible with some containers, and occasionally had issues), instead has its own inventory of recipe output, which can be extracted by hoppers and pipes.  Fix timeout & delay errors in Bucket storage.  "
  	,"1.8.13":"Automated User now works on entities.  New Items: Water Froster, Water Spreader, Water Splasher.  Fix sack of holding incompatibility with storage drawers, where you would sometimes get ConcurrentModification exceptions and have the emtpy sack go to negative stack sizes.  Fix Piston Scepter letting the offhand action trigger at the same time.   "
 	,"1.8.14":"Magic Bean: Now has config file entries to disable bonemeal, and disable dropping a bean (seed item) when fully grown.  Magic Bean loot table is now entirely in the config file (so you can remove items or add modded items).  New category mobs -> mobloottable so you can tweak the bonus item drop percentage on top of just the true/false.  The chance for cyclic items to spawn in dungeon chests is now in config as ChestLootChance and defaults to 4 (it used to be hardcoded as 7; still can be disabled by ChestLoot config as normal).  Removed Emerald Shovel and Axe from dungeon loot.  All Ender Projectiles now work out of a dispenser (Snow, Bombs, Blaze, Dungeon Finder, Fishing, Lightning, Torch, Water, Shears).  Updated some tooltips.  Controlled Miner is no longer fixed at 9x9, you can change the area that it mines.  Controlled Miner and Structure Builder now both have preview buttons.  Fixed the machines smoking when not running after chunk/world is reloaded.  Automated User can now toggle between two modes: Use and Attack.  "
	,"1.8.15":"Automatic Fishing Net: fixed a bug where it wasn't dropping contents when you break it.  Automatic Fishing Net now uses wood break/place sounds instead of stone.  "
  	,"1.9.0":"Updated to forge 12.18.3.2185.  Speed charm no longer gives the speed potion effect, it directly increases your speed without effects (so no particles, and it can stack with potions).  Implement PermissionAPI for compatibility with FTBUtilities.  Emerald gear is now on par with diamond instead of being weaker (still has enchantability of gold).   Nether Lapis spawn rate reduced by 1/3rd.  End and Nether ores can spawn veins as big as 8.  Nether Diamond and Emerald spawn rates reduced by 50%.  Slightly reduced spawn rate of End coal and End redstone ore.  Fix Button/text overlap in Automated User.  Removed several test messages that were spamming logs.  "
  	,"1.9.1":"Fix a crash that can happen when unbinding keys.  Ender Book experience cost config now allows value zero.  Cyclic Building Scepter is now compatible with blocks from Chisel and Bits blocks.  "
  	,"1.9.2":"New block: Fan.  Auto Fisher: Fixed not outputting items to things like hoppers.  Added a tooltip for Autofisher.  Fix tooltip on exchange scepter.  "
  	,"1.9.3":"Added recipe for Fan.  "
  	,"1.9.4":"Fix crash caused by certain types of modded armor in the Uncrafting grinder (such as bronze armor from IC2).  Auto fisher will now refuse to fish if a non-fishing rod item ends up in that slot.  Vein size and spawn chances of Nether ore and End ore now in config; tweak or disable each individually.  "
  	,"1.9.5":"New Block: Pattern Replicator.  Add config for disabling Viscous potion.  Fix speed charm exploit bug.  Speed charm now has more durability, but takes damage a bit faster, and costs emerald blocks instead of emerald items to craft and repair.  Added new mob spawn config to allow pigmen to spawn naturally in Mesa biomes (off by default).  "
  	,"1.9.6":"Fix bug when hoppers or conduits are inserting items into Controlled Miner; it now safely inserts tools into the correct slots and ignores the rest without crashing.  "
  	,"1.9.7":"New Block: Entity Detector"
  	,"1.9.8":"Fix block miners constantly playing equip sounds for fake player.  Fix Automated User in attack mode not calculating damage from enchantments or modded items (such as tinkers swords)"
 	,"1.9.9":"Fix sign editing feature calling a client only function on servers (was causing log spam but not crashing or causing issues).  Fix inventory extension not saving when servers add prefixes to player names such as '[Owner]<'.  Config entry Build Scepter HUD replaced with Scepter HUD which now can be in all four corners.  Exchange scepters can now have their hud move to all four corners using the same Scepter HUD config.  Exchange scepters can now build out of the third row of the inventory (in addition to the other two).  Fix Harvester and Miner crashing when put on top of a hopper (even though they have no inventory slots).  Make sure each 'FakePlayer' from this mod uses a different UUID.  Fix model rendering glitch on Block Placer.  BlockPlacer now plays sounds as it places.  "
 	,"1.9.10":"Potions from cyclic now show potion level in the tooltip: for example Health Boost potion now shows Health Boost V.  Add support for JEI Description tabs on most items.  Automatic Fishing Net and Pattern Replicator no longer burn as furnace fuel.  New Blocks: slime conveyors now come in four total variants: fast, normal, slow, slowest.   Slime conveyors: now take up full space of the block (like a carpet) instead of partial (like a pressure plate) so entities dont have inconsistent speed at edges of a block.  Slime conveyors now keep the entity 'grounded' so they dont get sudden bursts of speed when going down a block onto a conveyor on a lower level(as seen in xisumavoids video with the sheep. can be reverted to old behavior in config->SlimeConveyorKeepEntityGrounded).  Slime conveyors now have an autocorrect feature that keep moving entities in the center of the path (can be disabled in config->blocks->SlimeConveyorPullCenter)"
  	,"1.9.11":"Add block highlight overlay to Exchange scepters.  Fix Exchange scepter breaking blocks that are unbreakable.  Add blacklist to exchange scepter, default starts with only obsidian (modded blocks are supported).  Made some mild nerfs to both Exchange Scepters (reasoning: meant to be building & decorating, not be overpowered mining tools): Durability from 5000 to 1000 uses; takes damage per block replaced not per use (so a 3x3 area will take away 9 durability from item); cooldown from 10 ticks to 30 ticks; and upped recipe cost.  Fix slowfall potion from Wing charm getting stuck at 0:00.  Accepted a submission to update zh_CH.lang.  "
	,"1.9.12":"Stop the Controlled Miner from mining with tools on air blocks; this stops it from constantly draining durability from Tinkers Construct tools.  "
  	,"1.9.13":"New Block added: Aerial Faith Plate.  "
  	,"1.9.14":"Added Swim Speed Potion.  Added Block Rotator (Similar to Piston Scepter but its cheaper and only one mode).  Added Air Charm: Lets you walk on air while sneaking.Fixed Ender Aura not working: It now correctly prevents ender pearl damage.  Ender Aura Potion now also prevents ALL suffocation damage.  Ender Aura Potion now makes Enderman drop more exp from the player kill (randomly 1-5 extra).  "
  	,"1.9.15":"Update zh_CN lang file.  Config fix: claySize was missing from ocean category"
  	,"1.9.16":"New Item: Climbing Gloves - use any vertical surface as a ladder.  "
  	,"1.9.17":"New Item: Rod of Elevation.  Teleport yourself or any target entity to the nearest surface above.  "
  	,"1.9.18":"Air Charm now helps prevent fall damage if you fall and then use it in midair.  Fix the Structure Builder sometimes placing ghost blocks.  Structure Builder now has new modes: Solid, Stairway, Sphere.  Fix an infrequent crash with Harvester when you break it while its still running and about to harvest.  "
  	,"1.9.19":"Fix a crash caused by Cyclic when throwing an ender pearl while riding a mount (feature causing this is config>player>PearlsOnHorseback). "
  	,"1.10.0":"Machines now have animations when running.  A few items have new names, recipes, or textures.  Auto fisher now requires any four of the six faces to be wet, but it can be any sides so automation is easier.  Auto fisher now displays frequency in GUI, which is fishing speed based on nearby water.  Auto Fisher will no longer let enchanted fishing rods break, it drops them with 1 point left."
  	,"1.10.1":"Uncrafting grinder has two new error types for the ? button, one for if something is enchanted, and the other if the recipe type is unknown and not supported.  "
	,"1.10.2":"New Item: Redstone Lever, bind this to a lever in the world and then operate it remotely.  Added a few missing tooltips on other items. "
  	,"1.10.3":"Most item rendering rotation changed to match vanilla items (Thanks Frost2779).  Scaffolding block changes: renamed to Fragile Scaffolding, slowed down rate of decay, and recipe output increased.  New Block: Reactive Scaffolding that auto breaks when its neighbour breaks.  New Block: Replaceable Scaffolding: building on it replaces it instead of normal placement.  Reduced sound of scaffolding blocks.  Scaffolding blocks are climb-able like a ladder.  Scaffolding blocks can be built at long range: build while sneaking and it builds a block on the far opposite side, so you can easily build bridges or towers.  Fixed scaffolding transparency (it no longer kills grass).  "
  	,"1.10.4":"Fix a mod compatibility / item duplication glitch with a block from cyclic and the Drill from Actually Additions.  A few more updates for block item-model rotation.  "
  	,"1.10.5":"Item Magnet now can be shut off by giving it redstone power.  New Items: Glowing Chorus Fruit; Darksight Helmet; Nokozan Chestplate; Leggings of Zakarum; Boots of Elitch.  "
  	,"1.10.6":"Password Detector: when this block is triggered from the password in chat, it blocks the message from going to all players and instead sends you a single message.  Add missing config entry for Glowing chorus fruit.  Glowing chorus no longer gives nausea, and takes glowstone dust to craft instead of blocks.  Glowing chorus now gives flying for 10 seconds, up from 7.  Corrected some tooltips.  "
  	,"1.10.7":"Added Mattock: Mines dirt and stone in a 3x3 area.  Heart Container will now block you from eating it when you are full on hearts.  Fix Automated User letting item stacks go into negative numbers when using on multiple entities.  Fix Automated User using durability/items too fast, and crash on entity sometimes (found using buckets and cows).   Filled sack now attempts to find the translated name of the contained tile entity, instead of the text 'tile.whatever'.  Items added to random chest loot: Rod of Elevation, Climbing Gloves, Air Charm.  "
	,"1.10.8":"New item: Merchant Almanac - This opens an improved trading interface for the nearest villager.  "
  	,"1.10.9":"Remove some logging messages that were spamming the logs."
  	,"1.10.10":"Merchants Almanac: The button tooltips now list out all enchantments if the items being sold (books/armor/anything)"
  	,"1.10.11":"Fix broken texture in Pattern Builder.  Fix error in Ender Book tooltip.  The buttons to open your extended inventory & 3x3 crafting table now will show the letter of the key you have bound to open it; defaulting to the old 'I' 'C' as before if the keys are unbound.  The Inventory Crafting and Inventory Upgrade cakes now stack to 64, up from 1.  Mattock now has a tooltip.  Reduced recipe cost of Ender Orbs.  "
  	,"1.10.12":"Patch Automated User to try and avoid crashes when interacting with mobs from Minecraft Comes Alive mod.  New Features in Password Trigger: You can change it to pulse mode, and you can claim the block so nobody else can use or set the password.  Exchange scepters now attempt to correctly set block rotation on placement.  Exchange scepter mod compatibility fix with Painted Slabs from Ender IO.  Fix Ender Torch and Torch Launcher from double placing torches with a single shot.  zh_CH.lang updated.  "
  	,"1.10.13":"Fix the Password Trigger GUI closing when typing 'e' (or whatever key is bound to open inventory).  Blocks and World generation added:  Nether Iron, End Iron, Nether Redstone, End Gold (by request); controlled in config the same way as the rest of the world gen.  "
	,"1.10.14":"Bugfix to make sure chorus data persists through death.  Fan has GUI to control range and direction.  Charms can now be turned off by right clicking them on the inventory.  Purple power armor can now be turned off by right clicking.  "
	,"1.10.15":"New Content: Safe Dynamite, Mining Dynamite, Monster Ball, Experience Pylon.  Life Leech enchant now also restores a half heart with any damage dealt (it still restores some hunger and life on kill).  Life Leech enchant now displays heart particles above your head when it heals you.  Added new enchantments: Auto-Smelt and Experience Boost.  Controlled Miner now has a toggle button to switch between a whitelist and blacklist.  "
  	,"1.10.16":"Removed debug messages cluttering log files.  Fixed prospector getting the correct language file names from ores with metadata (such as from immersive engineering).  Prospector now has more config settings for modpacks; either a whitelist or a blacklist of things to look for.  "
 	,"1.10.17":"Fix a game crash that happened if you eat two inventory upgrades and have the keybinding disabled to open the screen.  "
  	,"1.10.18":"Structure builder will now check if placement is valid before building (avoids saplings placed on non-solid blocks for example)"
	,"1.10.19":"Fix harvester resetting its size property when chunk reloads.  Fix Mattock tooltip.  Add nether star and some progressive automation items to the uncrafting grinder default blacklist.  Removed nether star from default Magic Bean loot table (existing config files unchanged and you could still add it back).  Auto torch will no longer place in spectator mode.   "
	,"1.10.20":"Fix sheep exploit.  "
	,"1.10.21":"Auto Fisher now compatible with aquaculture, basemetal, modernmetal fishing rods.  Automatic User now correctly drops output items, such as milk buckets. Fix harvester sometimes crashing when used on agricraft crop sticks or Pixelmon apricorns. "
	,"1.10.22":"Fix a client side crash when the mod thinks you are trying to right click an item to turn a bauble off"
	,"1.10.23":"Mattock tool now checks block hardness (in all 9 locations) to avoid breaking unbreakable blocks; also it calls block.canEntityDestroy(..) for better cross-mod compatibility."
	,"1.10.24":"Automated User now correctly uses empty and full buckets with liquids placed in the world.  Added Automated User integration with tile entities that use the forge Fluid Capability system (for example, it can now use full & empty buckets with the Fluid Tank & Reservoir from Ender IO)"
	,"1.10.25":"Fixed a compatibility issue that was causing fall damage in certain situations that should not cause fall damage, while using Mekanism Jetpacks.  Fixed client-server desync with Launch enchantment, it now correctly resets your fall damage on use."
	,"1.10.26":"Automated user now (again) milks cows using empty bucket.  Fixed a rare client crash with Merchant Almanac if trading too fast and the trade list desyncs.  "
  	,"1.10.27":"No longer adds Dynamite VI to dungeon loot tables.  Fixed uncommon crash that happens when a Sack of Storage is spawned in from a loot table instead of being crafted (somehow gets created with bad data, hard to explain and replicate, example given is new world bonus chest)"
 	,"1.10.28":"Minimum forge version changed to 12.18.3.2316.  Harvester now works on Resourceful Crops mod. "
	,"1.10.29":"Donkeys will no longer eat lapis carrots (they are immune anyway).  The horse upgrade carrots will now get eaten only one at a time, and will no longer someties get set to item stack zero / crash the game.  Interfaces with textboxes now allow you to hold down the button, such as a letter or the delete key (Ender Book, Faith Plate, Password Detector).  "
	,"1.10.30":"Fixed some scaffolding blocks auto-breaking when they shouldn't.  Fixed ConcurrentModificationException error when using Cyclic Building Scepter.  "
  },
  "1.11.2":{
	"1.0.0":"Beta release; on par with 1.10.2-1.9.15  Removed: LightningSkeletonMutate, LightningZombieMutate, Block Miner Advanced.  Changed Features: Emerald Carrot no longer changes normal horses to zombie or skeleton; instead its used to tame existing Zombie and Skeleton horses.  Sleeping Mat works half the time but has a few issues, its a work in progress right now.  Several items have changed textures, recipes, and names.  "
  	,"1.1.0":"Ports all features from 1.10.2-1.10.11.  A few recipe changes were rolled back to match 1.10.2, trying in general to keep versions in parity.  WARNING: some ids/names were messed up in 1.0.0 and but fixed in this version, so forge will give you some warnings.  "
  	,"1.1.1":"Fix furnaces not breakable by tools.  "
  	,"1.1.2":"Now requires minimum forge-13.20.0.2252.  Fix extended player crafting and inventory screens crashing (the screens from the inventory cakes).  Fix a different crash that happened occasionally on startup / world load (AbstractMethodError)"
  	,"1.1.3":"[port of 1.10.13]  Fix broken texture in Pattern Builder.  Fix error in Ender Book tooltip.  The buttons to open your extended inventory & 3x3 crafting table now will show the letter of the key you have bound to open it; defaulting to the old 'I' 'C' as before if the keys are unbound.  The Inventory Crafting and Inventory Upgrade cakes now stack to 64, up from 1.  Mattock now has a tooltip.  Reduced recipe cost of Ender Orbs.  Patch Automated User to try and avoid crashes when interacting with mobs from Minecraft Comes Alive mod.  New Features in Password Trigger: You can change it to pulse mode, and you can claim the block so nobody else can use or set the password.  Exchange scepters now attempt to correctly set block rotation on placement.  Fix Ender Torch and Torch Launcher from double placing torches with a single shot.  zh_CH.lang updated.  Fix the Password Trigger GUI closing when typing 'e' (or whatever key is bound to open inventory).  Blocks and World generation added:  Nether Iron, End Iron, Nether Redstone, End Gold (by request); controlled in config the same way as the rest of the world gen.  "
	,"1.1.4":"Bugfix to make sure chorus data persists through death.  Fan has GUI to control range and direction.  Charms can now be turned off by right clicking them on the inventory.  Purple power armor can now be turned off by right clicking.  Fix Baubles API compatibility with the charms.  "
	,"1.2.0":"Re-balanced some recipes (avoid exploits & more access to early game low power content without ender pearls).  New Content: Safe Dynamite, Mining Dynamite, Monster Ball, Experience Pylon.  Life Leech enchant now also restores a half heart with any damage dealt (it still restores some hunger and life on kill).  Life Leech enchant now displays heart particles above your head when it heals you.  Added new enchantments: Auto-Smelt and Experience Boost.  Controlled Miner now has a toggle button to switch between a whitelist and blacklist.  Added Lapis Apple that can tame undead horses.  Fix a mod conflict causing uncrafting grinder to spew items.  Make sure Controlled Miner can harvest soft blocks like Sugar Cane.  Emerald apple no longer edible by players.  Fix rare crash event when rendering inventory buttons. Stop uncrafting grinder from continuing to run even with an empty itemslot.  "
 	,"1.2.1":"Fix enchantment id of Experience Boost enchantment being zero, and not being in the config file.  Added Block Reach enchantment: put it on your chestplate to increase player reach from 5 to 16.  "
  	,"1.2.2":"Removed leftover debug statements from log files.  Fix Controlled Miner whitelist recognizing certain plants such as reeds.  Brush Scythe now harvests 1-tall flowers from the Plants mod by Shadows_Of_Fire.  Fix Remote Lever not triggering block neighbour updates when lever is indirectly powering something.  "
  	,"1.2.3":"Fix uncrafting grinder spitting items on the ground even when inventory is not full.  Update JEI compatibility with potions from cyclic.  Viscous potion now requires an awkward potion instead of just a water bottle.  Automatic Fishing Net is now compatible with fishing rods from the Aquaculture mod."
  	,"1.2.4":"Fix the game crashing when you open sack of storage and then click on the sack that was just opened. "
	,"1.2.5":"Fix the Merchant Almanac crashing when used on new villagers or when new trades are learned.  Fixed prospector getting the correct language file names from ores with metadata (such as from immersive engineering).  Prospector now has more config settings for modpacks; either a whitelist or a blacklist of things to look for.  "
  	,"1.2.6":"Fix a game crash that happened if you eat two inventory upgrades and have the keybinding disabled to open the screen.  Fix game crash in the Block Miner"
  	,"1.2.7":"Climbing Glove changes: Can toggle on or off with right-click the same as charms; no longer needs to be on your hotbar; now can be equipped in a baubles slot.  You can now activate ender wings with a right click on them while inventory is open.  Structure builder will now check if placement is valid before building (avoids saplings placed on non-solid blocks for example)"
  	,"1.2.8":"Fix auto-torch crashing game when running out of durability.  "
	,"1.2.9":"Fix harvester resetting its size property when chunk reloads.  Fix Mattock tooltip.  Add nether star and some progressive automation items to the uncrafting grinder default blacklist.  Removed nether star from default Magic Bean loot table (existing config files unchanged and you could still add it back).  Auto torch will no longer place in spectator mode.  Fix the inventory crafting 3x3 crafting grid sometimes crashing when dragging itemstacks while the MouseTweaks mod is installed  "
 	,"1.3.0":"New item: Soulstone.  New Block: Unchant Pylon - used to remove enchantments from anything.  New Block: Auto Crafter.  Fixed a crash when shift-clicking items in Experience Pylon.  Experience Pylon collection radius increased to 5, up from 2; storage capacity increased to 20,000 from 1000.  Experience Pylon now has the ability to deposit XP straight from the player, as well as new buttons to toggle each function.  Nether Iron Ore and End Iron Ore now drop iron nuggets instead of ingots.  Ender Shears gives double wool drops.  Removed various loot table configs, mob drop changes, worldgen, since this is better done with vanilla JSON loot tables, or other mods such as InControl and Ocean Floor (List of all config file entries removed: PolarBearLoot, BatsLeather, ElderGuardianDiamonds, EndermiteEyeCrystal, ShulkerLoot, SilverfishIron, StraySkeletonPackedIce, Zombie Drops Nerfed, Sheep Shear Bonus, Leather Bonus, Pork Bonus, Iron Bonus, Classic Oceans).  Similarly, removed Mob Spawning module and 'Mob Spawns' config cateory.  Interdiction plate buffed to counteract fast mounted mobs and Rough Mobs: fires every half second up from each second, and speed increased from 1.4 from 0.9.  "
  	,"1.3.1":"Dungeonfinder flight path has been overhauled: Speed much slower at the start and gradually speeding up so you can actually follow it.  It still flies mostly horizontal at first and goes vertical later.  Auto Crafter JEI support added.  Auto Crafter is faster, firing every 20 ticks instead of 40.   "
	,"1.3.2":"Automatic User now correctly drops output items, such as milk buckets.  Fragile Torches feature config entry defaults to false now.  Replaceable scaffolding fixed (now it actually gets replaced with your held block).  Exchange scepters will no longer try to place non-block items and set air.  "
	,"1.3.3":"Prevent a crash getting drops out of Giacomos experience seedling mod when using Garden Scythe.  Pattern Replicator now renders its bounding boxes using translucent shadow-cubes instead of particles (looks cleaner and less lag clientside).  Experience pylon now has a Deposit All button.  "
	,"1.3.4":"New Item: Player Launcher.  Structure Builder now renders a preview of what its about to build.  "
 	,"1.3.5":"Fixed a crash caused by shift-clicking an item into a machine that has no inventory (such as Harvester).  Player Launcher: added a crafting recipe, and it now preserves horizontal momentum.  Added brewable Bounce potions.  Automated User now has a range setting up to 9x9 (previously was only directly in front)... Great for planting or bonemeal-ing your fields!  "
	,"1.3.6":"Added Soundproofing.  Added Workbench.  Fixed Bouncy potion effect from the player launcher affecting and bouncing players without the active potion effect on.  "
	,"1.4.0":"New Item: Cyclic Guidebook - only exists if you add the Guide API mod https://minecraft.curseforge.com/projects/guide-api.  Removed Block Miner Advanced (the 3x3x3 one) since it was completely redundant, use the Controlled miner or Block Miner instead.  Air charm now works when not sneaking; INSTEAD it always lets you walk on air at normal speed, and sneaking will let you slowly descend.  Fixed Air Charm not letting you jump in midair unless you are standing still, so now you can airwalk and jump up one blockspace at a time.  Fixed the Structure Builder preview button .  Default configs changed: Nether diamond spawn chance changed from 6 to 2, End Diamond ore spawn change changed from 10 to 4, Plant Despawning Saplings defaults to false.  Some of the more common/low powered Cyclic items have been removed from dungeon chest loot registry.  "
	,"1.4.1":"Added Gold Minecart, Gold Furnace Minecart, Stone Minecart.  "
	,"1.4.2":"Added Turrent Minecart and Dropper Minecart.  Automated User can now interact with minecarts (previously was only living entities).  Updated projectile rendering which stop them sometimes hitting the throwing player clienside and becoming invisible, and this fixes the dynamite playing explosion sounds on throw instead of on impact.  Fixed Guidebook pages going off screen, and a few typos.  Fixed the breaking particles of several blocks (so they arent the broken black/purple).  Fixed block hardness of the Auto Crafter, Workbench, Soundproofing, and the plates (so they are no longer instant-break).  New Guidebook category: Transport.  "
	,"1.4.3":"Cyclic minecarts now work out of dispensers.  Fix Gold Minecart not picking up entities on collision.  Re-wrote Gold Furnace Minecart collision and movement logic, now gets stuck less and slow down less pushing other carts.  Gold furnace minecart does not auto move when you give it fuel, and it tells you current fuel total.  Removed 'world generation / Biome Crops' config & feature, as it was possibly causing world generation lag, in addition to being fairly bare bones, not fully configurable, and kind of boring... other mods do it better."
  	,"1.4.4":"Fix missing texture in Workbench and fix JEI crafting support."
	  ,"1.4.5":"Reduced speed of Player Faster Ladder option by a factor of six to prevent launching you if the ladder is really tall.  Fixed an item loss bug in Uncrafting Grinder if it was working on a valid recipe with less items than required at the end of a stack.  Add HarvesterBlacklist in config file, by default it contains 'terraqueous:pergola' so harvester and garden scythe can be blocked from harvesting blocks that are coded to be food/bushes, but are not intended to be.   "
	  ,"1.4.6":"Mattock tool now checks block hardness (in all 9 locations) to avoid breaking unbreakable blocks; also it calls block.canEntityDestroy(..) for better cross-mod compatibility."
  	,"1.4.7":"Fix crashed caused by using scythe on certain leaves (caused by the config blacklist added in v1.4.5)"
	,"1.5.0":"Now requires Forge version 13.20.0.2300 or higher.  Block Miner and Block Placer can now face up and down, in addition to horizontal directions (so full 6 directional placement just like a Dispenser).  Harvester now captures drops in its inventory.  Automatic User now works with all forge buckets and fluid tanks.  Updated a few machine GUIs.  Many machines that act on an area now render their preview area using ghost blocks and a toggle button.  Many machines now optionally can consume furnace-fuel, which increases their speed.  Fixed Structure Builder and Pattern Replicator not playing block placing sounds.  For all three Scythes (Brush, Tree, Garden) you can hold shift to reduce the range by half.  "
	,"1.5.1":"Fix the new fuel slots machines destroying the empty bucket when consuming lava as fuel.  Add new config option to Sleeping Mat that makes it set players spawn point just like a bed (defaults false).  "
  	,"1.5.2":"Fix client-side game crash in Auto Fishing Net.  "
  	,"1.5.3":"Fix broken item tooltip.  Mattock now repairable in an anvil using obsidian.  Automated User now works empty glass bottles on water.   Automated User now has input and output slots for better automation (with hoppers/pipes).  Tweaked/optimized shift-clicking fuel into blocks with an inventory and a fuel slot.  Fix block transparency on a few things (example: grass will no longer die under a Fan or a Pylon).  Fix Block Miner and Block Placer affecting the opposite direction that they appear to be facing (you may have to break and replace existing blocks to fix).  Improved compatibility with plants, leaves, crops, and mushrooms for several mods including Biomes o Plenty, Actually Additions, and Rustic.  "
	,"1.5.4":"Fixed a compatibility issue that was causing fall damage in certain situations that should not cause fall damage, while using Mekanism Jetpacks.  Fixed client-server desync with Launch enchantment, it now correctly resets your fall damage on use.  Updated zh_CN.lang translation file (thanks to TartaricAcid).  "
	,"1.5.5":"Fixed brush scythe and tree scythe sometimes not dropping items.  Improved how many cyclic machines interact with pipes and hoppers: fuel always comes in the side, top and bottom for in and output.  Auto-Torch now works from bauble slot.  New config entry AutoTorchLightLevel.  Cyclic machines now more compatible with pipes and transfer systems from other mods (example: Extra Utilities Transfer pipes; tech detail: supports forge CapabilityItemHandler).  Automated User now has a Y-offset button so you can aim it up or down one block."
	,"1.5.6":"New Enchantments: Quickdraw and Beheading.  New Item: Evoker Fang.  Fragile Torches feature now affects Stone Torch and Tiny Torch (from Tinkers and AA respectively), and also it respects the 'mobGriefing' gamerule (this feature is still turned off by default in the blocks config category).  "
	,"1.5.7":"Fix client side crash that sometimes happen when right clicking items inside Chizel and Bits bag (misfire of right click to turn charms on and off).  "
	,"1.5.8":"Nether Ores now registered in ore dictionary as ore blocks (so for example anything that processes redstone ore will work on nether and end redstone ore).  Existing recipes now work with ore dictionary items (example: ingots, dyes, sticks, etc).  Fixed a few typos in tooltips and guidebook.  "
	,"1.5.9":"Experience Boost enchantment now gives XP directly to player (when mining, not combat); this was done to avoid lag when using hammers or a vein miner.  Interfaces with textboxes now allow you to hold down the button, such as a letter or the delete key (Ender Book, Faith Plate, Password Detector).  The horse upgrade carrots will now get eaten only one at a time, instead of double.  Fixed horse info in F3 not showing for donkeys, zombie, and skeleton horses.  "
	,"1.5.10":"Remove JSON recipe files that leaked over from the 1.12 build, and remove a bunch of logspam on startup "
  	,"1.5.11":"Update zh_CN language file" 
  },
  "1.12":{
  	"1.5.6":"Initial port from 1.11.2-1.5.6"
  	,"1.5.7":"Fixed the server subscribing to tooltip render events which prevented server startup.  Recipes have been converted to new JSON system.  Needs forge 14.21.0.2338 higher.  "
  	,"1.5.8":"Guide API compatibility added back in, get it here https://mods.curse.com/mc-mods/minecraft/228832-guide-api"
  	,"1.5.9":"Fixed uncrafting grinder not giving out ingredients.  Fixed a crash when using the workbench.  Experience Boost enchantment now gives XP directly to player (when mining, not combat); this was done to avoid lag when using hammers or a vein miner.  Re-enabled Baubles API compatibility."
  	,"1.5.10":"Nether and End Ores now registered in ore dictionary as ore blocks (so for example anything that processes redstone ore will work on nether and end redstone ore).  Existing recipes now work with ore dictionary items (example: ingots, dyes, sticks, etc).  Fixed a few typos in tooltips and guidebook.  Fixed crafting bug in the workbench and inventory crafting that would temporarily disable recipes.  Fix fall damage desync bug with climbing gloves.  Fix many missing tooltips.  Fix item tooltip boxes not rendering in cyclic GUI's.  Fixed text pages adding to guide book twice (doubled).  "
	,"1.5.11":"Stop cyclic machines trying to work while chunks are unloaded, causing TPS issues on servers.  Default config values changed (affects new and not existing config files): For both end and nether ores, spawnChanceDiamond = 1 and spawnChanceEmerald = 1.   For Uncrafter: added elytra and techreborn:uumatter to both BlacklistOutput and BlacklistInput.  Added resourcefulcrops to BlacklistMod.  Removed 'Elytra Repair' config entry and feature (overpowered and not working right).  Monster ball is now reuseable; does not break after a single use.   Fixed Ender Wings and Ender Book not playing sounds on teleport.  Made small changes to about five recipes.   Added support for Enchantment Descriptions (which are added by walia and other mods).  Fix BeheadingExtraMobs config system for the enchantment, it now uses modname:monster-player, matching the summon command.  Fix buttons on some GUI's having broken textures on the bottom.  Automated User in attack mode will no longer hit entities outside of its bounding box. "
	,"1.6.0":"No longer uses JSON recipe files, this fixes the error in forge that removes ALL mod recipes when any one item is disabled in config.  All machines in cyclic that have fuel slots will no longer run for free, they now require fuel.  Fixed some tooltip issues.  The Ender Book and Ender Wing items now hook into forge event system, so they can get affected/blocked/redirected other items/blocks (compatibility with DarkUtilities and other mods).  Interfaces with textboxes now allow you to hold down the button (Ender Book, Faith Plate, Password Detector).  Automated User can now attack tiny entities such as silverfish.  Reduced cooldown on Exchange scepters.  Fixed wither skeleton skulls not dropping from Beheading enchantment.  Beheading enchant will no longer crash the game when used on a player.  All new custom made sounds for Ender Wings and Ender Book.  Fixed a potential exploit in Unchant Pylon.   Experience pylon range increased to 8 blocks away, up from 5.  Fixed Experience pylon collection area; it is now centered on the block instead of only working on one side.   "
	,"1.6.1":"You can now sneak to cancel sleeping in the Sleeping Mat.  Fix item tooltips not showing in Sack of Storage.  Fix Entity Detector range being offcenter; also added a preview button to render selected area.  Auto Fisher should no longer let fish and other loot into fishing rod slot when the rod breaks.  Fixed some missing recipes.  Charms can now be repaired in an anvil instead of crafting table.  The horse upgrade carrots will now get eaten only one at a time, instead of double. "
	,"1.7.0":"Controlled miner now accepts items into the tool slot from above (hoppers & other automation - thanks to CatAndHorse).  New block: Hydrator for making concrete, and other blocks.  Doubled the damage output of the Evoker Fang.  Purple ability armor no longer takes chain armor to craft, and has similar defense to diamond.  New Item: Apple of Lofty Stature.  New Item: Inverted Stirrups.  Bucket Storage block has been overhauled and replaced by a new block: Fluid Storage Tank that takes any fluid.   Registered Milk, Experience, and Poison in forge Fluid Registry, which means they can be put into fluid tanks or a bucket.  Bathing in milk will cure potion effects just like drinking it.  Experience Pylon overhauled to now use experience fluid (WARNING: existing placed pylons during upgrade may lose xp).  "
	,"1.7.1":"Fix crash on startup from version 1.7.0 that happens if Biomes o Plenty is installed (both mods have poison fluid, and cyclic in 1.7.0 was adding recipe in an unsafe way.)  Fix broken Item texture model for Hydrator.  Structure builder can now place blocks underwater.  "
	,"1.7.2":"Launch enchantment tweaks: You can now sneak to jump normally and avoid launch-jumping (before this change it was very hard to jump-stack up with blocks); increased cooldown a bit; you can now double-jump straight up if your horizontal movement is zero, before this change you would always jump at a forced angle while standing still.  Fixed the scaffolding feature where you can sneak and build to place on the opposite side of the block.  Fix extra heart containers becoming temporarily invisible when changing dimensions (portal travel).  Fix item tooltips not rendering in player's extended inventory.  Torch launcher can now be repaired in an anvil.  Slightly reduced EXP bonus from Experience Boost enchantment.  Many new recipes added to Hydrator.  Fixed custom recipes from Hydrator leaking over and working in crafting table.  Fixed shift-clicking into Hydrator inventory.  Fixed Apple of Lofty Stature not persisting step height changes through death or game relog.  "
	,"1.7.3":"Slime conveyors and plates now harvestable by a pickaxe in a reasonable amount of time.  Hydrator and XP Pylon keeps its fluid contents when breaking and placing.  Hydrator will no longer accept non-water fluids from buckets.  Item Magnet and Interdiction Plate no longer connect to fences.  Launch enchant can now be used while mounted to make your horse double jump (warning: horse will still take fall damage, be careful).  Glowing Chorus Fruit now gives flight for 5 minutes instead of 10 seconds, and also does not give hunger potion debuff anymore; also tweaked the recipe and made sure flying timer persists through death.  Poison liquid is now purple instead of green.  Harvester now has two modes (by request).  New block: Item Collector.    "
	,"1.7.4":"New configs in player category: Player can set their step height on or off by default (the same as Apple of Lofty Stature), and set a players default heart containers (same as the /sethealth command or Heart container items).  "
	,"1.7.5":"Stopped the Item Collector from filling up the Filter with items picked up from the ground.  Fix text overflow on Fan GUI buttons.  Fixed the Fan pushing entities one extra block in some cardinal directions.  Added speed controls to Fan GUI.  "
  	,"1.7.6":"Fixed the Merchant Almanac failing to open.  Added configs to disable registering of Milk and Poison fluids.  Experience fluid is disabled whenever the Experience Pylon is disabled.  Fixed Harvester sometimes not gathering all the drops.  Water Spreader now sends correct block updates on use, so you wont get 'stuck' source water blocks that do not flow.  "
	,"1.7.7":"Updated zh_CN lang file.  Added five more filter slots to the Item Collector.  Attempt to fix client-desync in the Fan block when the redstone toggle button is used.  Fixed the left-click Editable Signs feature.  Fix Merchant Almanac not using tradeable items from bottom slots of inventory.  "
	,"1.7.8":"Fix a game crash that can happen while holding a key and exiting.  Thrown dynamite will no longer explode in water.  Corrected the tooltip on Air Charm.  "
	,"1.7.9":"Fixed the Fluid Tank not rendering fluid content updates when filled or drained by other pipes and pumps.  Fixed Hydrator water bucket input slot not working.  Fixed a Hydrator item dupe bug.  Experience Pylon: increase speed of Spray mode, it now puts 50 exp per orb instead of 10, and allowed it to go right down to zero (wont get stuck with 2 left).  Machines will stop animating and smoking now when they run out of fuel.  Fuel bar in machines will now render even when empty.  Fuel bar in machines now have a tooltip to show exact quantity.  New global config added with option to disable fuel requirements of ALL machines.  New global config to move fuel bar above the GUI instead of to the side (default is unchanged).   "
	,"1.7.10":"Shear block now craftable with wool instead of obsidian; texture changed to match.  Fix dupe bug with Auto Smelt enchantment when combined with Tinkers or Silents Gems tools in certain conditions.  Fix a crash that can happen with sack of storage on large inventories such as Actually Additions large crate (especially in laggy servers or LAN worlds).  Cyclic creative tab is now sorted alphabetically by display name.  Enchantments from Cyclic will now show up in the creative tab. "
	,"1.7.11":"New blocks: Iron Spikes, Diamond Spikes, Sprinkler, Redstone Clock.  "
	,"1.8.0":"New Hydrator recipes.  Sounds added to Spikes.  Block miner and placer now face towards you when put down, consistent with other cyclic machines.   Added more details to certain guidebook entries (download the Guide API).  Fixed the blocks in the guidebook not rendering their item as the Guidebook Category.  Fixed JEI description tab not showing for cyclic content.  Launch enchant renamed to Multi-Jump.  Player Launcher now has enchanted glow to indicate forward mode.  Several recipes changed slightly.  Several of the simple throwing items have been removed or completely overhauled.  The following magic items have been added, each with a unique effect:  Duskflame, Spirit Seeker, Frost Bringer, Spawner Seeker, Chaos Reaper, Engraved Thunder, Antimatter Evaporator.  Added Sword of Decay, Sword of Atrophy, and Sword of Evasion.  Uncrafting Grinder now has custom sound effect, and will correctly become silent when empty.   Fixed Automated User using certain items or projectiles in the wrong direction.  Fixed intermittent crashes with Merchant Almanac being used quickly.  "  
  	,"1.8.1":"Remove server console / log file spam out of a few places including fluid tank and brewing recipes."
  	,"1.8.2":"Fixed step-height not walking up from path blocks so it now goes up 1+1/16th of a block (this is the feature given by Apple of lofty stature or the StepHeightDefault config).  Purple armor has been renamed to and no longer provides custom effects.  Vision Helmet is now the helmet that gives night vision.  New enchantment: Waterwalking.  Structure builder now has a new shape: Diagonal.  Structure builder now has a new rotation value: used to place stairs and other blocks at different rotations.   "
	,"1.8.3":"Fix waterwalking enchant firing when removed.  Fix waterwalking levitating you a full block above the water, it now tries to keep you at 0.1 of a block above. "
	,"1.8.4":"Patch the Structure Builder crashing when placing a block that has a missing or invalid placement sound.  Upgraded inventory is now 4 slots bigger instead of showing player armor.  Upgraded inventory has new buttons to swap the row of items with players hotbar.  "
	,"1.8.5":"Fixed the Fan crashing the game when changing dimensions and/or chunks unloading.  Compatible with Minecraft 1.2.2  "
	,"1.8.6":"New block: Empty Beacon.  Added speed control buttons to Automated User.  Fix the Step height feature not letting you sneak to stay on the block, and also now sneaking will let you not walk up the block (Apple of Lofty Stature player upgrade).  Controlled Miner's dig speed has been doubled; fuel consumption unchanged.  Item Collector now has a button to control the size of the target region, instead of the previous fixed 9x9 radius.  Redstone Clock now has controls to customize which faces output a signal on tick.    "
  }
  ,"1.12.2":{
	"1.9.0":"All potions remade to use vanilla system, instead of custom items; as a result of this you will see many items removed from the game since they have been replaced.  This helps for modpacks since many less IDs get used.  Potions now have Splash, Lingering, and Tipped arrows for each.  Added brewable potions for blindness, saturation, and wither.  Added Pharos Beacon, which works like a vanilla beacon but it eats potions to give out effects.  Cyclic Guide Book will now show up in Cyclic creative tab (if Guide API is installed).  Minimum forge version required is now 14.23.0.2494. "
	,"1.9.1":"Fixed an item dupe glitch.  Fixed a compatibility issue with sponge servers.  Fixed a ConcurrentModificationException crash when using Cyclic building scepter.  Added Potion of Frost Walker; works exactly like the enchantment.   "
	,"1.9.2":"Overhauled mod compatibility for the following items: Garden Scythe, Harvester, Brush Scythe, Tree Scythe; tested with many mods.  Harvester and Garden scythe no longer physically break the block and do a replant, instead they gently update the block state (less block updates means less lag on servers, less sounds clientside).  Garden scythe now drops loot on player instead of where it would land.  Brush Scythe no longer hits saplings.  New config ScytheBlacklist, works just like HarvesterBlacklist, also they both have a new wildcard system using * character.  Tree Scythe now has increased fortune drop rates for saplings.  New 'logging' category in the config file.   Fixed the Pharos Beacon not saving its toggle redstone state when reloading world.  Fixed Pharos Beacon not wiping out previous potion before adding another.  Fixed Pharos Beacon Recipe.  "
	,"1.9.3":"Added croparia:stem_* to the default HarvesterBlacklist config to avoid harvesting melon stems.  Fixed another item dupe glitch.  Shift clicking a water bucket in a Hydrator now puts it in the middle slot.  Fixed the Cyclic Guidebook from Guide-API not loading its recipe. "
  	,"1.9.4":"Added blacklist for pharos beacon, PharosBeaconBlacklist, so you can block some potion effects from the beacon.  "
	,"1.9.5":"Updated zh_CN translation (thanks to Aemande123).  Sleeping Mat now has a feature where you right-click in your inventory and you can toggle whether or not it will set your spawn when you sleep; because of this SleepingMatSetsSpawn config has been removed.  Fixed the empty Chest Sack not being consumed when used on a Botania Mana Pool.  "
  	,"1.9.6":"Autocrafter will now correctly save container items, such as empty buckets, when crafting with full containers (example: it now saves empty buckets when auto-crafting cake).  Changed all blocks/machines to open their GUIs on serverside first: for compatibility with FTB Utilities permissions checks for claimed chunks.   "
	,"1.9.7":"You can now sneak to avoid being pushed/launched by the Slime Conveyors and Slime Plates (can toggle in config file).  Updated the FTB Utilities permissions fix (from previous release)."
  	,"1.9.8":"Fixed world sync issue that can cause player kicked from server while Auto-Torch.  Attempt to gently preload chunks when teleporting using Ender Wings.     "
	,"1.9.9":"Fixed the Area mode in the Harvester not affecting one of the edges of the region.  Experience Pylon will now only collect orbs from the world every 22 ticks, instead of every single tick; this reduces load on  TPS & lag.  Fixed warning message in log startup about guideapi recipe registry.  Mod has now been jar-signed using the system built into forge.  "
  	,"1.9.10":"Fixed some typos from Password Block.  Fixed Magic Bean crop only giving seeds and not loot when gathered with some machines.   Fixed a bug where the  Experience Pylon would consume invalid items while bottling.  Experience Pylon now has more buttons to add and remove EXP; for this the Spray button was removed, as was the Bottle button, so it now processes empty bottles no matter what if they are in the slot.  Magnet Enchant: It can now be on any piece of gear, not just some tools; also its rarity was changed to VERY_RARE(4), used to be COMMON(1).  Magnet enchant can now reach up to level III; each level increases its range (4 + 4 per level, so level 1 is 8, 2 is 12, 3 is 16).  Fixed missing button tooltips in the Redstone Clock.  Fixed the Redstone Clock not sending block updates to the client.   Redstone Clock can now be set to power zero (0) to turn it off completely.      "
	,"1.9.11":"Removed some logging spam from Harvester.  Added an extra safeguard to prevent player experience becoming negative from Exp Pylon.   Added spectrite content to default config for Uncrafter blacklists.  Several number-based buttons in some of the machines will now become disabled when they hit their min or max limit.  Structure Builder has new shapes (WARNING: if you have any builders running, simply turn them offbefore the update and verify the current shape is correct after the update).  Structure builder now has coordinate sliders to offset the center of the building location.  "
	,"1.9.12":"Fixed a Block placer dupe bug on sponge servers (thanks to a PR from github user 'curscascis')"
  	,"1.9.13":"Fix Experience Pylon not filling empty bottles.  Fix a button tooltip not localized in Experience Pylon.  Experience Pylon can now be toggled on and off with redstone, and the spray mode has been brought back by popular demand.  Fix residual exp lingering on the player when deposit All button used.  The Harvester and Automated User now connect to pipes/hoppers on all four sides, not just the bottom.  Automatic Fisher now drains RF instead of durability from tools if compatible (Flux-Infused Fishing Rod).  Optimize block placement in several areas, this should mean less chunk updates and more stability (thanks to github user phit); also this means previously silent tools such as the Exchange Scepters now has working block placement sounds.   Block Randomizer will now work on non-solid blocks such as glass, slabs, and stairs.  The Redstone Clock can now be controlled on and off using redstone input, and has the standard redstone toggle button in upper left.  "
	,"1.10.0":"New Blocks: Forester, Fluid Pump, Fluid Pipe, Wireless Transmitter, Wireless Receiver.  New command /nbtprint to get item data.  New item: Solid Ender Eye.  Machines that use fuel are now compatible with Forge Energy systems. MachinesNeedFuel config removed, but instead each machine can have its fuel needs set one by one.  FuelBarHorizontal config removed, each machine has a toggle button to control this.  Fluid Storage Tank now has better transparency, fluids are more visible in the dark, and hot liquids glow a little bit.  The 'Plant Despawning Saplings' feature now works with saplings from most mods, and not just vanilla saplings (feature still disabled by default).  Fixed some JEI tooltips.  All crafting grids are now compatible with the Crafting Tweaks mod (Workbench, Autocrafter, player 3x3 inventory upgrade).  Fixed GUI backgrounds not dimming as normal.  Improved compatibility of many machines interacting with modded item pipes and conduits.  Fixed some automation issues with Hydrator recipes; also reduced fluid cost and tweaked a few recipes.  Fix a conflict that breaks NBT data on crafting items from IC2 and Silent Gems. "
	,"1.10.1":"Add missing recipes and guidebook text.  Fixed fluid pipes and the pump flowing every direction except down.  Pipes will no longer show Empty label when actually flowing.  Reduce block hardness of pipes, and tweak hitbox of pipes to be more accurate.  Pipes tell you which direction they are flowing.  "
	,"1.10.2":"Added Item Pipe and Item Pump.  Fixed Fluid pump flowing in the wrong direction when facing vertically up or down.  Experience Pylon now values 20mb of fluid as 1 exp, which is consistent with all other mods that use experience fluid so it avoids exploits.  "
	,"1.10.3":"Fixed the forester not harvesting leaves, and spending too long in empty air space (it now correctly skips air and is much faster).  Soulstone now gives a few seconds of Fire Resistance when it revives you.  Emerald Apple now has a cheaper recipe.  Fixed Emerald Apple not getting consumed when fed to a zombie villager.   Added error handler to fluid pipes and pumps to safely log errors from other mods during fill or drain.   Multi-Jump enchantment now works on any armor-slot equipment; try it out on an Elytra for super-flight (previously it was only for boots).  "
	,"1.10.4":"Fixed item duplication bug.  Fixed compatibility of some blocks accepting input/output on the sides or top of the machine.  Items piped into the Unchant Pylon are now routed into the correct slot.  Fixed fluid pipes trying to push into external fluid tanks while empty.  Fixed pipe glitches during chunk unloading.  New block: Fluid Placer.  Pattern Replicator: now it outlines the exact shape of what its building; can now rotate the building in different directions from the original; and flip building on any axis; but requires power.   Fixed some errors in anvil repair recipes."
	,"1.10.5":"Fixed the Fuel Bar desynchronizing and flashing when playing on a server whenever the value goes above 32767.  Fixed Item Collector outputing the wrong item slots to pipes & hoppers.   Fixed the Harvester not getting crops from the Tomato and Chili plants from Rustic.   Harvester now correctly gathers from the top section of Simply Corn, vanilla Sugar Cane, and Industrial Hemp (from Industrial Engineering mod).  Harvester now correctly gathers items from the bulbs of the Attained Drops 2 mod (bulbs must be in target area, not the stem).  Added error handling to Sprinkler to prevent crashes from unconventional crops.  "
	,"1.10.6":"New Block: Item Sorter, for sorting anything from pipes or hoppers.  "
	,"1.10.7":"Fixed a glitch when breaking blocks around Diamond Spikes.   Fixed an item transfer glitch in the Workbench when shift-clicking and your inventory was full.  Obsidian armor renamed to Crystallized Obsidian; also fixed its pre-defined enchantments not showing up in JEI and not appearing when you craft with shift-click.  Fixed some Tile Entities not rendering effects when out of players view (beacons, preview areas of several machines).  Sleeping Mat will no longer trigger your offhand item when using it (placing blocks etc).  "
	,"1.10.8":"Fix Item sorter putting items in the first filter slot from certain sides/pipes.  Fixed Cyclic Building Scepter causing a crash when using the mouse wheel shortly before and after equipping it.  Fixed the 'All' button glitch in Experience Pylon, also increased the EXP limit to 50,000.  "
  	,"1.10.9":"Plate models now take up full block space (Slime Conveyors and Jump plates); also conveyors are no longer transparent.  Fixed Auto user not using items that are also blocks (for example, putting cobblestone into Advanced Mortars or other machines).  Auto User will no longer attack dead entities.  Automated User now hits smaller mobs such as baby zombies and silverfish when in Attack mode.  New config entry for Auto User called 'AutoUserMaxAttackPerAction', to limit how many things can get attacked per swing from the machine (default zero is unlimited).  Aerial Faith Plate now correctly adds and preserves player horizontal momentum during launches.   Harvester will no longer put crops into the fuel slot.   Kill and death messages from fake players now indicate which mod and block they come from, instead of a random UUID hash.   Fixed item and fluid pipes appearing to not be connected on one side when their length is only one (purely visual glitch).  "
	,"1.10.10":"New Blocks: Ender Bookshelf, Ender Library, Digital Typewriter, Trash Void.  Auto User will no longer place blocks (but will still use blocks as normal, this just fixes the bug when used with Advanced Mortars where it places cobblestone when the mortars durability breaks).  Translation file added: Chinese Traditional (zh_TW).  Corrupted Chorus noclip now displays in upper right instead of flooding chat.  Corrupted Chorus noclip ghost mode will no longer allow players to access the spectator toolbar. "
  	,"1.10.11":"Fixed client/server desync with the Scythe tools.  New config fluid_placer to disable the Fluid Placer block. "
	,"1.10.12":"Item Pump now has a GUI with a filter for whitelist/blacklist modes, and a redstone toggle button.  Fixed some bugs with some internal fluid tanks.  Updated zh_CN.lang file (by github user Aemande123).  "
  	,"1.11.0":"Fixed Item Pump sometimes pulling items into its whitelist filter instead of transferring them (when destinations are full).  New block: Powered Anvil.  New block: Powered Enchanter.  New Block: Apple Sprout (plant on leaves to grow apples).  New Enchantment: Excavation (with connected mining distance in config).  New Enchantment: Multi-shot to fire three arrows at once.   Fixed item models of Conveyors and Slime Plates (so they look like other 3D pressure plates).  "
	,"1.11.1":"Uncrafting grinder no longer takes items as input from pipes/hopers into the output area.  Fix visual glitch in the Powered Anvil screen.  If you set energy cost to zero for a machine, it will now hide its fuel bar toggle button.  Fixed Item model display on Trash Void, Digital Typewriter.  Powered Anvil now has the same placement sound as a regular Anvil.   Added tooltips to the OP swords, and reduced their shooting cooldown from 6 seconds to 1.  Experience Pylon no longer accepts any item from hoppers/pipes into the Glass Bottle slot.  Forester no longer accepts non-saplings in its inventory (uses ore dictionary to match).  Automatic Fishing Net no longer accepts non-fishing rod items into the rod slot.  The player Inventory Upgrade screen now shows the player armor slots on the left.  The player Inventory Upgrade screen now has a button to quick swap all armor slots.   Block Reach enchantment can now be applied to Elytra.  Hydrator recipes now have a showing Move Items button in the JEI list.  Hydrator now supports adding custom recipes using ZenScript from CraftTweaker mod (both add and remove), also tweaked some of the default recipes.  Added Russian translation (ru_RU) by github user kellixon."
  	,"1.11.2":"Fixed items moving wrongly when shift-clicking them in the extended player inventory upgrade screen.  Item Sorter now has a new option where you can tell it to ignore item damage in a row when comparing incoming items to the filter (defaults to normal mode).  Fixed a game crash when certain items containing GUI screens were opened.  Minimum forge version is now 14.23.1.2594."
	,"1.12.0":"Pipes have been renamed to Cables, have an updated block model (huge thanks to InsomniaKitten), and no longer use TESR animations (huge optimization).  Pumps have been renamed to Extraction Cables and have new block model and texture.  Added Energy Cable to transmit power (RF and others), along with Energy Extraction Cable.  Added Bundled Cable, which can transfer fluids, items, and power all in one blockspace.  Fixed item drops of Wireless blocks.  Fixed Crafting bug with shapeless recipes in the Hydrator.  Spikes will now pop off the block if pushed by a piston out over empty space.  Controlled Miner will no longer drain power when turned off.  Brush Scythe now correctly breaks Gardens from Harvestcraft with their drops.  Fluid Storage Tank has new model/graphics.  Fluid Storage Tank now auto-drains downwards if another one of itself is below.  "
	,"1.12.1":"Enchanter will no longer eat non-book items.  Updated Russian translation (ru_RU.lang) thanks to TimeConqueror and ollegsey.  New JSON models for the endgame swords (by Arcaniax on blockmodels.com, links in curseforge description).  Added mild animations to several item textures.  Fixed 'Infested Ores' feature not always reading from config correctly.  Added a new PigmenEnrage config, defaults to false: 'If true, mining Nether ore has a 20% chance of enraging a nearby PigZombie within 16 blocks'.  Fixed the rotation feature of Pattern Replicator.  Pattern replicator now correctly places: redstone, repeaters, comparators, tripwire, signs.  The feature 'Plant Despawning Saplings' no longer uses a fake-player to work which fixes an issue with chunk loaders.  Certain machines will no longer cause lag by spawning particles when no players are nearby.  "
	,"1.13.0":"New block: Precise Dropper.  Added an extensive Peat farming system to generate energy, content includes:  Carbon Catalyst, Biomass, Soaked Peat, Peat Fuel, Peat Bog, Peat Deposit, Peat-fired Generator, Peat Farmer.  Nether and End ores now blend in with any resource pack, instead of forcing vanilla netherrack and endstone textures (huge shoutout to vadis365 on discord).  Harvester will now stop working when the inventory is completely full.  You can now disable the particle splash effect on the Sprinkler using shift-right-click (empty handed works best).  Added en_UD.lang (thanks to The-Fireplace).  Fixed a visual glitch with Extraction Cables.  Fixed a tooltip in the Structure Builder.  "
  	,"1.13.1":"Fluid and Energy Extraction Cables now have a new GUI button to toggle the redstone requirement; default value is Always On.   Fixed extractors not working vertically.  Fixed automation insert issues with the Peat machines.  "
  	,"1.13.2":"Fix shift-click in Precice Dropper GUI.  Fixed Precise Dropper only using the first slot, it now uses all slots.  Harvester will only spawn the purple harvest particles when preview is enabled.  Uncrafter no longer allows hoppers & pipes to extract items from fuel slot.  Structure builder now stops working if its empty.  Reduced the scale of the sword models when on the ground in world.  Added two textboxes to the Redstone Clock GUI to set the ticks more easily.   Added missing config option to disable Apple Sprout.  Fixed sort/registry order of how content shows up in JEI.  Fixed harvester correctly gathering and breaking cactus.  "
  	,"1.13.3":"Auto crafter will no longer consume energy while idling, only when crafting; also increased the default config energy cost from 25 up to 150.  Fixed the HUD timer for Corrupted Chorus.  Fixed an SMP only crash when using Auto User to milk cows with buckets.  "
  	,"1.13.4":"Fixed a gitch when full buckets are made by the user and exported right away with a pipe/hopper.  Fixed a very uncommon crash when sprinklers would try to animate while a chunk (or the world) is loading.   Fixed the Redstone Clock checkboxes sometimes not saving, and fixed a glitch with the downward facing powered state not sending neighbor block updates.  Nether/End ores will no longer attempt to spawn silverfish/endermites if the game is in peaceful mode (this was causing a very uncommon crash.  no changes to config controls on this.).  Removed seven sound files from registry that were being registered but never got used (slight improvement in load time).  "
  	,"1.13.5":"Fixed the digital typewriter (screen) not saving the text justification on world reload.  The Harvester now works with all Pams tree-fruits, and Apple trees from Rustic (Harvester still has a 1-tall range so place Harvesters accordingly).  Fixed some 'ModelLoaderRegistry$LoaderException' errors on startup (does not affect gameplay or visuals; hopefully improved load time).  Automatic Fisher will no longer break when gamerule doDaylightCycle = false.  "
  	,"1.13.6":"Fixed Wireless Transmitter position not being saved and transferred.  Increased upper limit of speed in GUI of Auto User.  New feature 'Enderman Pickup Blocker', to make sure enderman cannot pickup any blocks (can disable in config file).  The Sleeping Mat now renders the player laying down - no more sleeping standing up.  "
	,"1.14.0":"New feature: ore blocks in the nether and end for 28 ore types, 2 blocks per ore for endstone and netherrack versions.  These are all disabled by default as you can see in the new 'cyclic_ores.cfg' file and can be enabled in a batch or one by one.  These have no existing use at all in this mod alone, but they are all compatible with the ore dictionary and are meant for use in machines and recipes from OTHER mods.  Existing vanilla nether and end ores are unchanged, and are affected by the same configs as before.  "
  	,"1.14.1":"Fixed Powered Anvil bug where output item is overwritten and lost when a new item is fully repaired and moves over.  Added block_anvil.RepairBlacklist config to the Powered Anvil to disable any item from being repaired.  Added magic_net.CaptureBlacklist config to define entities that cannot be captured.   Powered Anvil now references the default diamond block texture (resource pack compatibility).  "
  	,"1.14.2":"Apple Sprouts no longer drop treasure apples.  GUI Screens will now auto-close when their block is destroyed.  Fixed item model and localization issue in the 'cyclic_ores.cfg' blocks.  Emerald Carrot fixes: Fixed spawn tooltip, fixed spawn exploit, and it now remembers the taming owner when converted to a Zombie Horse.  Fixed a player movement conflict with the Bounce Potion effect while flying with Elytra.  "
  	,"1.14.3":"Fixed visibility and homing vector of Spirit Seeker missiles.  Fixed errored ores sometimes generating in nether, it now correctly respects config file.  Fixed stone minecart starting non-empty.  "
  	,"1.14.4":"Updated zh_CN.lang (thanks to sandtechnology and Aemande123 on github).  Added some error handling to Energy Cables.  Peat Generator now auto-outputs power similar to other generators (slower than extractor).  Fixed Precise Dropper working with hoppers and pipes.  Harvester now compatible with Natura berry bushes.  Fixed rendering bug with Pharos Beacon.  Fixed the Automated User trying to use invalid items that have stack size zero.  Automated User now works on Apricorn trees from Pixelmon.  Added config options to disable the projectile ability of the endgame swords.  Cable transfer rates added to config file.  Fixed the Forester not planting saplings when there is a roof overhead (it can now plant regardless if sky is visible or not).  "
  	,"1.14.5":"Updated texture of Dark Fire and Apple Sprout while growing (by the amazing Ithronyar).  Fixed magnet enchant not having its effect when enchanted on armor.  Fixed a (hard to replicate) crash if game or chunk loads slowly and animations attempt to happen while tile entity is still null.  Very slight change to Redstone Clock recipe.  Fixed Precise Dropper crashing servers.  Added config SackHoldingBlacklist to block containers from being picked up.  "
  	,"1.14.6":"Fixed a bug related to Automated User and the Lightwell from Astral Sorcery.  New config 'AutoUserTargetBlacklist' in case anyone needs to blacklist a target block (in world) from being acted upon by the Automated User; default is empty.  Updated ru_RU.lang (thanks to kellixon on github).  "
 	,"1.14.7":"Updated 3D model and textures for Hydrator (thanks to Ithronyar).  Fluid buckets no longer listed in Cyclic creative tab (was causing crashes in some versions of JEI in some modpacks).  Fixed null blocks generating in the nether with certain config settings (will change to air blocks with this update). "
  	,"1.14.8":"Fixed a whitelist bug with the Controlled Miner.  Sleeping mat now correctly dismounts for you if you try to sleep on the saddle.  Updates to zh_CN.lang (thanks to Minecraftbegin2snow on github).  Fixed Structure Builder not saving height data on world reload.  New Item used to craft Darkflame Hex and new animated dark fireball texture by Ithronyar (no other item uses yet, so it shares the same config).  Emerald Carrot retextured and renamed as Infected Carrot - new recipe, same effect.  Ender Book no longer rounds off stored coordinates to integers, so it will teleport you more precisely (such as the center of the block).  Fixed a small glitch where Auto Crafter fuel slot would not consuming items when fuel is at zero.  Added a small optimization to network traffic on player join (Thanks to darkh4x).  "
  	,"1.14.9":"Fixed a dupe bug with certain items that have durability (see issue tracker for details).  Almost all custom sound effects have been totally remade and improved from scratch thanks to Ithronyar.  Update zh_CN.lang thanks to sandtechnology.   Merchant Almanac is less picky and now lets you use it directly on a villager instead of only on a nearby block.  Item Extraction Cable has a new button texture  "
	
	
	,"1.15.0":"Default drop list for Magic Bean hugely nerfed, and default value of MagicBeanGrownDropSeed is now false (existing configs unchanged).  Updated some textures.  Removed bucket slot for hydrator.   Removed some legacy worldgen features/configs (GoldRivers, OreSingletons Emerald Ore Boost).  Removed config feature 'TerrariaInventoryButtons' (was disabled by default anyway).  Many blocks now consume energy that did not previously (Auto Fisher, Hydrator, Dropper... disable and tweak in config as normal).  Peat Generator no longer accepts power as input, is output only.  Fluid Tank now has connected block textures vertically.  Slime Conveyors renamed to Conveyor Belts, along with new block models that have corner pieces and ramps.   Missing config added for dropper_exact.   Config 'SageAndDruidVillagers' removed, instead one config per villager.   Peat fuel no longer has to be dried in a furnace, it generates power right away.  Removed the Carbon Catalyst item, and Biomass is now created in a Hydrator recipe.   Block Rotator renamed to Wooden Wrench.  Added tooltips to fluid bar components in GUI screens.  Added Battery blocks.  Fan blocks can now face all six directions including up/down; not just horizontal.  Fan GUI now uses slider controls.  "
  
  
  }
}

